bobmittmann/thinkos/sdk/include/stm32f/stm32f-eth.h
/* 
 * Copyright(C) 2012 Robinson Mittmann. All Rights Reserved.
 * 
 * This file is part of the libstm32f.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 3.0 of the License, or (at your option) any later version.
 * 
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 * 
 * You can receive a copy of the GNU Lesser General Public License from 
 * http://www.gnu.org/
 */

/** 
 * @file stm32f-eth.h
 * @brief
 * @author Robinson Mittmann <bobmittmann@gmail.com>
 */ 

#ifndef __STM32F_ETH_H__
#define __STM32F_ETH_H__

/*-------------------------------------------------------------------------
  Ethernet (ETH): media access control (MAC) with DMA controller
  -------------------------------------------------------------------------*/

/* Ethernet MAC configuration register */
#define STM32F_ETH_MACCR 0x0000

/* Bits 31:24 Reserved */

/* Bit 25 - CRC stripping for Type frames */
#define ETH_CSTF (1 << 25)
/* When set, the last 4 bytes (FCS) of all frames of Ether type (type 
   field greater than 0x0600) will be stripped and dropped before forwarding 
   the frame to the application. */

/* Bit 24 Reserved */

/* Bit 23 - Watchdog disable */
#define ETH_WD (1 << 23)
/* When this bit is set, the MAC disables the watchdog timer on the receiver, 
   and can receive frames of up to 16 384 bytes.
   When this bit is reset, the MAC allows no more than 2 048 bytes of the 
   frame being received and cuts off any bytes received after that. */

/* Bit 22 - Jabber disable */
#define ETH_JD (1 << 22)
/* When this bit is set, the MAC disables the jabber timer on the transmitter, 
   and can transfer frames of up to 16 384 bytes.
   When this bit is reset, the MAC cuts off the transmitter if the 
   application sends out more than 2048 bytes of data during transmission. */

/* [21..20] Reserved */

/* Bits [19..17] - Interframe gap */
#define ETH_IFG ((19 - 17) << 17)
/* These bits control the minimum interframe gap between frames 
   during transmission.
	000: 96 bit times
	001: 88 bit times
	010: 80 bit times
	....
	111: 40 bit times
	Note: In Half-duplex mode, the minimum IFG can be configured for 64 
	bit times (IFG = 100) only. Lower values are not considered. */

/* Bit 16 - Carrier sense disable */
#define ETH_CSD (1 << 16)
/* When set high, this bit makes the MAC transmitter ignore the MII CRS 
   signal during frame transmission in Half-duplex mode. No error is 
   generated due to Loss of Carrier or No Carrier during such transmission.
   When this bit is low, the MAC transmitter generates such errors due to 
   Carrier Sense and even aborts the transmissions. */

/* Bit 15 Reserved */


/* Bit 14 - Fast Ethernet speed */
#define ETH_FES (1 << 14)
/* Indicates the speed in Fast Ethernet (MII) mode:
 * 0: 10 Mbit/s
 * 1: 100 Mbit/s 
 */

/* Bit 13 - Receive own disable */
#define ETH_ROD (1 << 13)
/* When this bit is set, the MAC disables the reception of frames in 
   Half-duplex mode.
   When this bit is reset, the MAC receives all packets that are given by 
   the PHY while transmitting. 
   This bit is not applicable if the MAC is operating in Full-duplex mode. */

/* Bit 12 - Loopback mode */
#define ETH_LM (1 << 12)
/* When this bit is set, the MAC operates in loopback mode at the MII. The 
   MII receive clock input (RX_CLK) is required for the loopback to work 
   properly, as the transmit clock is not looped-back internally. */

/* Bit 11 - Duplex mode */
#define ETH_DM (1 << 11)
/* When this bit is set, the MAC operates in a Full-duplex mode where it can 
   transmit and receive simultaneously. */

/* Bit 10 - IPv4 checksum offload */
#define ETH_IPCO (1 << 10)
/* When set, this bit enables IPv4 checksum checking for received frame 
   payloads' TCP/UDP/ICMP headers. When this bit is reset, the checksum 
   offload function in the receiver is disabled and the corresponding PCE 
   and IP HCE status bits (see Table 142 on page 827) are always cleared. */

/* Bit 9 - Retry disable */
#define ETH_RD (1 << 9)
/* When this bit is set, the MAC attempts only 1 transmission. When a 
   collision occurs on the MII, the MAC ignores the current frame 
   transmission and reports a Frame Abort with excessive collision error in 
   the transmit frame status.
   When this bit is reset, the MAC attempts retries based on the 
   settings of BL.
   Note: This bit is applicable only in the Half-duplex mode. */

/* Bit 8 Reserved */


/* Bit 7 - Automatic pad/CRC stripping */
#define ETH_APCS (1 << 7)
/* When this bit is set, the MAC strips the Pad/FCS field on incoming frames 
   only if the lengthâ€™s field value is less than or equal to 1 500 bytes. All 
   received frames with length field greater than or equal to 1 501 bytes are 
   passed on to the application without stripping the Pad/FCS field.
   When this bit is reset, the MAC passes all incoming frames unmodified. */

/* Bits [6..5] - Back-off limit */
#define ETH_BL ((6 - 5) << 5)
/* The Back-off limit determines the random integer number (r) of slot time 
   delays (4 096 bit times for 1000 Mbit/s and 512 bit times for 
   10/100 Mbit/s) the MAC waits before rescheduling a transmission attempt 
   during retries after a collision.
Note: This bit is applicable only to Half-duplex mode.
00: k = min (n, 10)
01: k = min (n, 8)
10: k = min (n, 4)
11: k = min (n, 1),
where n = retransmission attempt. The random integer r takes the value in the range 0 â‰¤ r < 2k */

/* Bit 4 - Deferral check */
#define ETH_DC (1 << 4)
/* When this bit is set, the deferral check function is enabled in the 
   MAC. The MAC issues a Frame Abort status, along with the excessive deferral 
   error bit set in the transmit frame status when the transmit state machine 
   is deferred for more than 24 288 bit times in 10/100-Mbit/s mode. Deferral 
   begins when the transmitter is ready to transmit, but is prevented because 
   of an active CRS (carrier sense) signal on the MII. Defer time is not 
   cumulative. If the transmitter defers for 10 000 bit times, then 
   transmits, collides, backs off, and then has to defer again after 
   completion of back-off, the deferral timer resets to 0 and restarts.
   When this bit is reset, the deferral check function is disabled and the 
   MAC defers until the CRS signal goes inactive. This bit is applicable only 
   in Half-duplex mode. */

/* Bit 3 - Transmitter enable */
#define ETH_TE (1 << 3)
/* When this bit is set, the transmit state machine of the MAC is enabled 
   for transmission on the MII.
   When this bit is reset, the MAC transmit state machine is disabled after 
   the completion of the transmission of the current frame, and does not 
   transmit any further frames. */

/* Bit 2 - Receiver enable */
#define ETH_RE (1 << 2)
/* When this bit is set, the receiver state machine of the MAC is enabled for 
   receiving frames from the MII.
   When this bit is reset, the MAC receive state machine is disabled after 
   the completion of the reception of the current frame, and will not receive 
   any further frames from the MII. */

