bobmittmann/thinkos/sdk/include/stm32f/stm32f-eth.h
/* [1..0] Reserved */


/* Ethernet MAC frame filter register */
#define STM32F_ETH_MACFFR 0x0004


/* Bit 31 - Receive all */
#define ETH_RA (1 << 31)
/* When this bit is set, the MAC receiver passes all received frames on to 
   the application, irrespective of whether they have passed the 
   address filter. The result of the SA/DA filtering is updated (pass or fail) 
   in the corresponding bits in the receive status word.
   When this bit is reset, the MAC receiver passes on to the application only 
   those frames that have passed the SA/DA address filter. */

/* [30..11] Reserved */


/* Bit 10 - Hash or perfect filter */
#define ETH_HPF (1 << 10)
/* When this bit is set and if the HM or HU bit is set, the address 
   filter passes frames that match either the perfect filtering or the hash 
   filtering.
   When this bit is cleared and if the HU or HM bit is set, only frames that 
   match the Hash filter are passed. */

/* Bit 9 - Source address filter */
#define ETH_SAF (1 << 9)
/* The MAC core compares the SA field of the received frames with the values 
   programmed in the enabled SA registers. If the comparison matches, then 
   the SAMatch bit in the RxStatus word is set high. When this bit is set 
   high and the SA filter fails, the MAC drops the frame.
   When this bit is reset, the MAC core forwards the received frame to the 
   application. It also forwards the updated SA Match bit in RxStatus 
   depending on the SA address comparison. */

/* Bit 8 - Source address inverse filtering */
#define ETH_SAIF (1 << 8)
/* When this bit is set, the address check block operates in inverse 
   filtering mode for the SA address comparison. The frames whose SA 
   matches the SA registers are marked as failing the SA address filter.
   When this bit is reset, frames whose SA does not match the SA registers 
   are marked as failing the SA address filter. */

/* Bits [7..6] - Pass control frames */
#define ETH_PCF ((7 - 6) << 6)
/* These bits control the forwarding of all control frames (including 
   unicast and multicast PAUSE frames). Note that the processing of PAUSE 
   control frames depends only on RFCE in Flow
   Control Register[2].
00: MAC prevents all control frames from reaching the application
01: MAC forwards all control frames to application except Pause control frames
10: MAC forwards all control frames to application even if they fail 
the address filter
11: MAC forwards control frames that pass the address filter.
These bits control the forwarding of all control frames (including unicast and multicast PAUSE
frames). Note that the processing of PAUSE control frames depends only on RFCE in Flow
Control Register[2].
00 or 01: MAC prevents all control frames from reaching the application
10: MAC forwards all control frames to application even if they fail the address filter
11: MAC forwards control frames that pass the address filter. */

/* Bit 5 - Broadcast frames disable */
#define ETH_BFD (1 << 5)
/* When this bit is set, the address filters filter all incoming 
   broadcast frames.
   When this bit is reset, the address filters pass all received 
   broadcast frames. */

/* Bit 4 - Pass all multicast */
#define ETH_PAM (1 << 4)
/* When set, this bit indicates that all received frames with a multicast 
   destination address (first bit in the destination address field is '1') 
   are passed.
   When reset, filtering of multicast frame depends on the HM bit. */

/* Bit 3 - Destination address inverse filtering */
#define ETH_DAIF (1 << 3)
/* When this bit is set, the address check block operates in inverse 
   filtering mode for the DA address comparison for both unicast and 
   multicast frames.
   When reset, normal filtering of frames is performed. */

/* Bit 2 - Hash multicast */
#define ETH_HM (1 << 2)
/* When set, MAC performs destination address filtering of received 
   multicast frames according to the hash table.
   When reset, the MAC performs a perfect destination address filtering for 
   multicast frames, that is, it compares the DA field with the values 
   programmed in DA registers. */

/* Bit 1 - Hash unicast */
#define ETH_HU (1 << 1)
/* When set, MAC performs destination address filtering of unicast 
   frames according to the hash table.
   When reset, the MAC performs a perfect destination address filtering 
   for unicast frames, that is, it compares the DA field with 
   the values programmed in DA registers. */

/* Bit 0 - Promiscuous mode */
#define ETH_PM (1 << 0)
/* When this bit is set, the address filters pass all incoming frames 
   regardless of their destination or source address. The SA/DA filter fails 
   status bits in the receive status word are always cleared when PM is set. */

/* Ethernet MAC hash table high register */
#define STM32F_ETH_MACHTHR 0x0008



/* Bits [31..0] - Hash table high */
#define ETH_HTH ((31 - 0) << 0)
/* 
This field contains the upper 32 bits of Hash table. */

/* Ethernet MAC hash table low register */
#define STM32F_ETH_MACHTLR 0x000C



/* Bits [31..0] - Hash table low */
#define ETH_HTL ((31 - 0) << 0)
/* 
This field contains the lower 32 bits of the Hash table */

/* Ethernet MAC MII address register */
#define STM32F_ETH_MACMIIAR 0x0010



/* [31..16] Reserved */


/* Bits [15..11] - PHY address */
//#define ETH_PA ((15 - 11) << 11)
#define ETH_PA_MSK (((1 << (4 + 1)) - 1) << 11)
#define ETH_PA_SET(VAL) (((VAL) << 11) & ETH_PA_MSK)
#define ETH_PA_GET(REG) (((REG) & ETH_PA_MSK) >> 11)
/* This field tells which of the 32 possible PHY devices are being accessed. */

/* Bits [10..6] - MII register */
#define ETH_MR_MSK (((1 << (4 + 1)) - 1) << 6)
#define ETH_MR_SET(VAL) (((VAL) << 6) & ETH_MR_MSK)
#define ETH_MR_GET(REG) (((REG) & ETH_MR_MSK) >> 6)
/* These bits select the desired MII register in the selected PHY device. */

/* Bit 5 Reserved */

/* Bits [4..2] - Clock range */
//#define ETH_CR ((4 - 2) << 2)
#define ETH_CR_MSK (((1 << (2 + 1)) - 1) << 2)
#define ETH_CR_SET(VAL) (((VAL) << 2) & ETH_CR_MSK)
#define ETH_CR_GET(REG) (((REG) & ETH_CR_MSK) >> 2)

#define ETH_CR_HCLK_42 (0 << 2)
#define ETH_CR_HCLK_62 (1 << 2)
#define ETH_CR_HCLK_16 (2 << 2)
#define ETH_CR_HCLK_26 (3 << 2)
#define ETH_CR_HCLK_102 (4 << 2)

/* The CR clock range selection determines the HCLK frequency and is used 
   to decide the frequency of the MDC clock:
	Selection HCLK MDC Clock
	000 60-100 MHz HCLK/42
	001 100-120 MHz HCLK/62
	010 20-35 MHz HCLK/16
	011 35-60 MHz HCLK/26
	100 150-180 MHz HCLK/102
	101, 110, 111 Reserved
- */

/* Bit 1 - MII write */
#define ETH_MII_MW (1 << 1)
/* When set, this bit tells the PHY that this will be a Write operation using 
   the MII Data register. If this bit is not set, this will be a Read 
   operation, placing the data in the MII Data register. */

/* Bit 0 - MII busy */
#define ETH_MII_MB (1 << 0)
/* This bit should read a logic 0 before writing to ETH_MACMIIAR and 
   ETH_MACMIIDR. This bit must also be reset to 0 during a Write to 
   ETH_MACMIIAR. During a PHY register access, this bit is set to 0b1 by the 
   application to indicate that a read or write access is in progress. 
   ETH_MACMIIDR (MII Data) should be kept valid until this bit is cleared by 
   the MAC during a PHY Write operation. The ETH_MACMIIDR is invalid until 
   this bit is cleared by the MAC during a PHY Read operation. The 
   ETH_MACMIIAR (MII Address) should not be written to until this bit is 
   cleared. */

/* Ethernet MAC MII data register */
#define STM32F_ETH_MACMIIDR 0x0014

