bobmittmann/thinkos/sdk/include/stm32f/stm32f-eth.h
/* [31..16] Reserved */

/* Bits [15..0] - MII data */
#define ETH_MII_MD (0xffff)
/* This contains the 16-bit data value read from the PHY after a 
   Management Read operation, or the 16-bit data value to be written to 
   the PHY before a Management Write operation. */


/* Ethernet MAC flow control register */
#define STM32F_ETH_MACFCR 0x0018


/* Bits [31..16] - Pause time */
#define ETH_PT ((31 - 16) << 16)
/* 
This field holds the value to be used in the Pause Time field in the transmit control frame. If the
Pause Time bits is configured to be double-synchronized to the MII clock domain, then
consecutive write operations to this register should be performed only after at least 4 clock
cycles in the destination clock domain. */

/* [15..8] Reserved */


/* Bit 7 - Zero-quanta pause disable */
#define ETH_ZQPD (1 << 7)
/* 
When set, this bit disables the automatic generation of Zero-quanta pause control frames on
the deassertion of the flow-control signal from the FIFO layer.
When this bit is reset, normal operation with automatic Zero-quanta pause control frame
generation is enabled. */

/* Bit 6 Reserved */


/* Bits [5..4] - Pause low threshold */
#define ETH_PLT ((5 - 4) << 4)
/* 
This field configures the threshold of the Pause timer at which the Pause frame is
automatically retransmitted. The threshold values should always be less than the Pause Time
configured in bits[31:16]. For example, if PT = 100H (256 slot-times), and PLT = 01, then a
second PAUSE frame is automatically transmitted if initiated at 228 (256 â€“ 28) slot-times after
the first PAUSE frame is transmitted.
Selection
Threshold
00
Pause time minus 4 slot times
01
Pause time minus 28 slot times
10
Pause time minus 144 slot times
11
Pause time minus 256 slot times
Slot time is defined as time taken to transmit 512 bits (64 bytes) on the MII interface. */

/* Bit 3 - Unicast pause frame detect */
#define ETH_UPFD (1 << 3)
/* 
When this bit is set, the MAC detects the Pause frames with the stationâ€™s unicast address
specified in the ETH_MACA0HR and ETH_MACA0LR registers, in addition to detecting Pause
frames with the unique multicast address.
When this bit is reset, the MAC detects only a Pause frame with the unique multicast address
specified in the 802.3x standard. */

/* Bit 2 - Receive flow control enable */
#define ETH_RFCE (1 << 2)
/* 
When this bit is set, the MAC decodes the received Pause frame and disables its transmitter
for a specified (Pause Time) time.
When this bit is reset, the decode function of the Pause frame is disabled. */

/* Bit 1 - Transmit flow control enable */
#define ETH_TFCE (1 << 1)
/* 
In Full-duplex mode, when this bit is set, the MAC enables the flow control operation to
transmit Pause frames. When this bit is reset, the flow control operation in the MAC is
disabled, and the MAC does not transmit any Pause frames.
In Half-duplex mode, when this bit is set, the MAC enables the back-pressure operation. When
this bit is reset, the back pressure feature is disabled.
Bit 0 FCB/BPA: Flow control busy/back pressure activate
This bit initiates a Pause Control frame in Full-duplex mode and activates the back pressure
function in Half-duplex mode if TFCE bit is set.
In Full-duplex mode, this bit should be read as 0 before writing to the Flow control register. To
initiate a Pause control frame, the Application must set this bit to 1. During a transfer of the
Control frame, this bit continues to be set to signify that a frame transmission is in progress.
After completion of the Pause control frame transmission, the MAC resets this bit to 0. The
Flow control register should not be written to until this bit is cleared.
In Half-duplex mode, when this bit is set (and TFCE is set), back pressure is asserted by the
MAC core. During back pressure, when the MAC receives a new frame, the transmitter starts
sending a JAM pattern resulting in a collision. When the MAC is configured to Full-duplex
mode, the BPA is automatically disabled. */

/* Ethernet MAC VLAN tag register */
#define STM32F_ETH_MACVLANTR 0x001C



/* [31..17] Reserved */


/* Bit 16 - 12-bit VLAN tag comparison */
#define ETH_VLANTC (1 << 16)
/* 
When this bit is set, a 12-bit VLAN identifier, rather than the complete 16-bit VLAN tag, is used
for comparison and filtering. Bits[11:0] of the VLAN tag are compared with the corresponding
field in the received VLAN-tagged frame.
When this bit is reset, all 16 bits of the received VLAN frameâ€™s fifteenth and sixteenth bytes are
used for comparison. */

/* Bits [15..0] - VLAN tag identifier (for receive frames) */
#define ETH_VLANTI ((15 - 0) << 0)
/* 
This contains the 802.1Q VLAN tag to identify VLAN frames, and is compared to the fifteenth
and sixteenth bytes of the frames being received for VLAN frames. Bits[15:13] are the user
priority, Bit[12] is the canonical format indicator (CFI) and bits[11:0] are the VLAN tagâ€™s VLAN
identifier (VID) field. When the VLANTC bit is set, only the VID (bits[11:0]) is used for
comparison.
If VLANTI (VLANTI[11:0] if VLANTC is set) is all zeros, the MAC does not check the fifteenth
and sixteenth bytes for VLAN tag comparison, and declares all frames with a Type field value
of 0x8100 as VLAN frames. */

/* Ethernet MAC remote wakeup frame filter register */
#define STM32F_ETH_MACRWUFFR 0x0028



/* Ethernet MAC PMT control and status register */
#define STM32F_ETH_MACPMTCSR 0x002C



/* Bit 31 - Wakeup frame filter register pointer reset */
#define ETH_WFFRPR (1 << 31)
/* 
When set, it resets the Remote wakeup frame filter register pointer to 0b000. It is automatically
cleared after 1 clock cycle. */

/* [30..10] Reserved */


/* Bit 9 - Global unicast */
#define ETH_GU (1 << 9)
/* 
When set, it enables any unicast packet filtered by the MAC (DAF) address recognition to be a
wakeup frame. */

/* [8..7] Reserved */


/* Bit 6 - Wakeup frame received */
#define ETH_WFR (1 << 6)
/* 
When set, this bit indicates the power management event was generated due to reception of a
wakeup frame. This bit is cleared by a read into this register. */

/* Bit 5 - Magic packet received */
#define ETH_MPR (1 << 5)
/* 
When set, this bit indicates the power management event was generated by the reception of a
Magic Packet. This bit is cleared by a read into this register. */

/* [4..3] Reserved */


/* Bit 2 - Wakeup frame enable */
#define ETH_WFE (1 << 2)
/* 
When set, this bit enables the generation of a power management event due to wakeup frame
reception. */

/* Bit 1 - Magic Packet enable */
#define ETH_MPE (1 << 1)
/* 
When set, this bit enables the generation of a power management event due to Magic Packet
reception. */

