bobmittmann/thinkos/sdk/include/stm32f/stm32f-eth.h
/* Bit 0 - Power down */
#define ETH_PD (1 << 0)
/* 
When this bit is set, all received frames will be dropped. This bit is cleared automatically when
a magic packet or wakeup frame is received, and Power-down mode is disabled. Frames
received after this bit is cleared are forwarded to the application. This bit must only be set
when either the Magic Packet Enable or Wakeup Frame Enable bit is set high. */

/* Ethernet MAC debug register */
#define STM32F_ETH_MACDBGR 0x0034



/* [31..26] Reserved */


/* Bit 25 - Tx FIFO full */
#define ETH_TFF (1 << 25)
/* 
When high, it indicates that the Tx FIFO is full and hence no more frames will be accepted for
transmission. */

/* Bit 24 - Tx FIFO not empty */
#define ETH_TFNE (1 << 24)
/* 
When high, it indicates that the TxFIFO is not empty and has some data left for transmission. */

/* Bit 23 Reserved */


/* Bit 22 - Tx FIFO write active */
#define ETH_TFWA (1 << 22)
/* 
When high, it indicates that the TxFIFO write controller is active and transferring data to the
TxFIFO. */

/* Bits [21..20] - Tx FIFO read status */
#define ETH_TFRS ((21 - 20) << 20)
/* 
This indicates the state of the TxFIFO read controller:
00: Idle state
01: Read state (transferring data to the MAC transmitter)
10: Waiting for TxStatus from MAC transmitter
11: Writing the received TxStatus or flushing the TxFIFO */

/* Bit 19 - MAC transmitter in pause */
#define ETH_MTP (1 << 19)
/* 
When high, it indicates that the MAC transmitter is in Pause condition (in full-duplex mode
only) and hence will not schedule any frame for transmission */

/* Bits [18..17] - MAC transmit frame controller status */
#define ETH_MTFCS ((18 - 17) << 17)
/* 
This indicates the state of the MAC transmit frame controller:
00: Idle
01: Waiting for Status of previous frame or IFG/backoff period to be over
10: Generating and transmitting a Pause control frame (in full duplex mode)
11: Transferring input frame for transmission */

/* Bit 16 - MAC MII transmit engine active */
#define ETH_MMTEA (1 << 16)
/* 
When high, it indicates that the MAC MII transmit engine is actively transmitting data and that
it is not in the Idle state. */

/* [15..10] Reserved */


/* Bits [9..8] - Rx FIFO fill level */
#define ETH_RFFL ((9 - 8) << 8)
/* 
This gives the status of the Rx FIFO fill-level:
00: RxFIFO empty
01: RxFIFO fill-level below flow-control de-activate threshold
10: RxFIFO fill-level above flow-control activate threshold
11: RxFIFO full */

/* Bit 7 Reserved */


/* Bits [6..5] - Rx FIFO read controller status */
#define ETH_RFRCS ((6 - 5) << 5)
/* 
It gives the state of the Rx FIFO read controller:
00: IDLE state
01: Reading frame data
10: Reading frame status (or time-stamp)
11: Flushing the frame data and status */

/* Bit 4 - Rx FIFO write controller active */
#define ETH_RFWRA (1 << 4)
/* 
When high, it indicates that the Rx FIFO write controller is active and transferring a received
frame to the FIFO. */

/* Bit 3 Reserved */


/* Bits [2..1] - MAC small FIFO read / write controllers status */
#define ETH_MSFRWCS ((2 - 1) << 1)
/* When high, these bits indicate the respective active state of the 
   small FIFO read and write controllers of the MAC receive frame 
   controller module. */

/* Bit 0 - MAC MII receive protocol engine active */
#define ETH_MMRPEA (1 << 0)
/* When high, it indicates that the MAC MII receive protocol engine is 
   actively receiving data and is not in the Idle state. */

/* Ethernet MAC interrupt status register */
#define STM32F_ETH_MACSR 0x0038

/* [15..10] Reserved */

/* Bit 9 - Time stamp trigger status */
#define ETH_TSTS (1 << 9)
/* This bit is set high when the system time value equals or exceeds the 
   value specified in the Target time high and low registers. This bit 
   is cleared when this register is read. */

/* [8..7] Reserved */

/* Bit 6 - MMC transmit status */
#define ETH_MMCTS (1 << 6)
/* This bit is set high whenever an interrupt is generated in the 
   ETH_MMCTIR Register. This bit is cleared when all the bits in this 
   interrupt register (ETH_MMCTIR) are cleared. */

/* Bit 5 - MMC receive status */
#define ETH_MMCRS (1 << 5)
/* This bit is set high whenever an interrupt is generated in the 
   ETH_MMCRIR register. This bit is cleared when all the bits in this 
   interrupt register (ETH_MMCRIR) are cleared. */

/* Bit 4 - MMC status */
#define ETH_MMCS (1 << 4)
/* This bit is set high whenever any of bits 6:5 is set high. It is 
   cleared only when both bits are low. */

/* Bit 3 - PMT status */
#define ETH_PMTS (1 << 3)
/* This bit is set whenever a Magic packet or Wake-on-LAN frame is received 
   in Power-down mode (See bits 5 and 6 in the ETH_MACPMTCSR register 
   Ethernet MAC PMT control and status register (ETH_MACPMTCSR) on 
   page 883). This bit is cleared when both bits[6:5], of this last 
   register, are cleared due to a read operation to the 
   ETH_MACPMTCSR register. */

/* [2..0] Reserved */


/* Ethernet MAC interrupt mask register */
#define STM32F_ETH_MACIMR 0x003C

/* [15..10] Reserved */

/* Bit 9 - Time stamp trigger interrupt mask */
#define ETH_TSTIM (1 << 9)
/* When set, this bit disables the time stamp interrupt generation. */

/* [8..4] Reserved */

/* Bit 3 - PMT interrupt mask */
#define ETH_PMTIM (1 << 3)
/* When set, this bit disables the assertion of the interrupt signal due 
   to the setting of the PMT Status bit in ETH_MACSR. */

/* [2..0] Reserved */


/* Ethernet MAC address 0 high register */
#define STM32F_ETH_MACA0HR 0x0040



/* Bit 31 - Always 1. */
#define ETH_MO (1 << 31)
/*  */

/* [30..16] Reserved */


/* Bits [15..0] - MAC address0 high [47:32] */
#define ETH_MACA0H ((15 - 0) << 0)
/* 
This field contains the upper 16 bits (47:32) of the 6-byte MAC address0. This is used by the
MAC for filtering for received frames and for inserting the MAC address in the transmit flow
control (Pause) frames. */

/* Ethernet MAC address 0 low register */
#define STM32F_ETH_MACA0LR 0x0044



/* Bits [31..0] - MAC address0 low [31:0] */
#define ETH_MACA0L ((31 - 0) << 0)
/* 
This field contains the lower 32 bits of the 6-byte MAC address0. This is used by the MAC for
filtering for received frames and for inserting the MAC address in the transmit flow control
(Pause) frames. */

/* Ethernet MAC address 1 high register */
#define STM32F_ETH_MACA1HR 0x0048



/* Bit 31 - Address enable */
#define ETH_AE (1 << 31)
/* 
When this bit is set, the address filters use the MAC address1 for perfect filtering. When this bit
is cleared, the address filters ignore the address for filtering. */

/* Bit 30 - Source address */
#define ETH_SA (1 << 30)
/* 
When this bit is set, the MAC address1[47:0] is used for comparison with the SA fields of the
received frame.
When this bit is cleared, the MAC address1[47:0] is used for comparison with the DA fields of
the received frame. */

/* Bits [29..24] - Mask byte control */
#define ETH_MBC ((29 - 24) << 24)
/* 
These bits are mask control bits for comparison of each of the MAC address1 bytes. When
they are set high, the MAC core does not compare the corresponding byte of received DA/SA
with the contents of the MAC address1 registers. Each bit controls the masking of the bytes as
follows:
â€“ Bit 29: ETH_MACA1HR [15:8]
â€“ Bit 28: ETH_MACA1HR [7:0]
â€“ Bit 27: ETH_MACA1LR [31:24]
...
â€“ Bit 24: ETH_MACA1LR [7:0] */

/* [23..16] Reserved */


/* Bits [15..0] - MAC address1 high [47:32] */
#define ETH_MACA1H ((15 - 0) << 0)
/* 
This field contains the upper 16 bits (47:32) of the 6-byte second MAC address. */

/* Ethernet MAC address1 low register */
#define STM32F_ETH_MACA1LR 0x004C



