bobmittmann/thinkos/sdk/include/stm32f/stm32f-eth.h
/* Bits [31..0] - MAC address1 low [31:0] */
#define ETH_MACA1L ((31 - 0) << 0)
/* 
This field contains the lower 32 bits of the 6-byte MAC address1. The content of this field is
undefined until loaded by the application after the initialization process. */

/* Ethernet MAC address 2 high register */
#define STM32F_ETH_MACA2HR 0x0050

/* Bit 31 - Address enable */
#define ETH_AE (1 << 31)
/*When this bit is set, the address filters use the MAC address2 for perfect filtering. When reset,
the address filters ignore the address for filtering. */

/* Bit 30 - Source address */
#define ETH_SA (1 << 30)
/*
When this bit is set, the MAC address 2 [47:0] is used for comparison with the SA fields of the
received frame.
When this bit is reset, the MAC address 2 [47:0] is used for comparison with the DA fields of
the received frame.
MBC: Mask byte control
These bits are mask control bits for comparison of each of the MAC address2 bytes. When set
high, the MAC core does not compare the corresponding byte of received DA/SA with the
contents of the MAC address 2 registers. Each bit controls the masking of the bytes as follows:
Bits 29:24â€“ Bit 29: ETH_MACA2HR [15:8]
â€“ Bit 28: ETH_MACA2HR [7:0]
â€“ Bit 27: ETH_MACA2LR [31:24]
...
â€“ Bit 24: ETH_MACA2LR [7:0] */

/* [23..16] Reserved */

/* Bits [15..0] - MAC address1 high [47:32] */
#define ETH_MACA2H ((15 - 0) << 0)
/* This field contains the upper 16 bits (47:32) of the 6-byte MAC address2. */

/* Ethernet MAC address 2 low register */
#define STM32F_ETH_MACA2LR 0x0054

/* Bits [31..0] - MAC address2 low [31:0] */
#define ETH_MACA2L ((31 - 0) << 0)
/* This field contains the lower 32 bits of the 6-byte second MAC address2. The content of this
field is undefined until loaded by the application after the initialization process. */

/* Ethernet MAC address 3 high register */
#define STM32F_ETH_MACA3HR 0x0058


/* Bit 31 - Address enable */
#define ETH_AE (1 << 31)
/* 
When this bit is set, the address filters use the MAC address3 for perfect filtering. When this bit
is cleared, the address filters ignore the address for filtering. */

/* Bit 30 - Source address */
#define ETH_SA (1 << 30)
/* 
When this bit is set, the MAC address 3 [47:0] is used for comparison with the SA fields of the
received frame.
When this bit is cleared, the MAC address 3[47:0] is used for comparison with the DA fields of
the received frame. */

/* Bits [29..24] - Mask byte control */
#define ETH_MBC ((29 - 24) << 24)
/* 
These bits are mask control bits for comparison of each of the MAC address3 bytes. When
these bits are set high, the MAC core does not compare the corresponding byte of received
DA/SA with the contents of the MAC address 3 registers. Each bit controls the masking of the
bytes as follows:
â€“ Bit 29: ETH_MACA3HR [15:8]
â€“ Bit 28: ETH_MACA3HR [7:0]
â€“ Bit 27: ETH_MACA3LR [31:24]
...
â€“ Bit 24: ETH_MACA3LR [7:0] */

/* [23..16] Reserved */


/* Bits [15..0] - MAC address3 high [47:32] */
#define ETH_MACA3H ((15 - 0) << 0)
/* 
This field contains the upper 16 bits (47:32) of the 6-byte MAC address3. */

/* Ethernet MAC address 3 low register */
#define STM32F_ETH_MACA3LR 0x005C



/* Bits [31..0] - MAC address3 low [31:0] */
#define ETH_MACA3L ((31 - 0) << 0)
/* 
This field contains the lower 32 bits of the 6-byte second MAC address3. The content of this
field is undefined until loaded by the application after the initialization process.
MMC register description */

/* Ethernet MMC control register */
#define STM32F_ETH_MMCCR 0x0100



/* [31..6] Reserved */


/* Bit 5 - MMC counter Full-Half preset */
#define ETH_MCFHP (1 << 5)
/* 
When MCFHP is low and bit4 is set, all MMC counters get preset to almost-half value. All
frame-counters get preset to 0x7FFF_FFF0 (half - 16)
When MCFHP is high and bit4 is set, all MMC counters get preset to almost-full value. All
frame-counters get preset to 0xFFFF_FFF0 (full - 16) */

/* Bit 4 - MMC counter preset */
#define ETH_MCP (1 << 4)
/* 
When set, all counters will be initialized or preset to almost full or almost half as per
Bit5 above. This bit will be cleared automatically after 1 clock cycle. This bit along
with bit5 is useful for debugging and testing the assertion of interrupts due to MMC
counter becoming half-full or full. */

/* Bit 3 - MMC counter freeze */
#define ETH_MCF (1 << 3)
/* 
When set, this bit freezes all the MMC counters to their current value. (None of the MMC
counters are updated due to any transmitted or received frame until this bit is cleared to 0. If
any MMC counter is read with the Reset on Read bit set, then that counter is also cleared in
this mode.) */

/* Bit 2 - Reset on read */
#define ETH_ROR (1 << 2)
/* 
When this bit is set, the MMC counters is reset to zero after read (self-clearing after reset). The
counters are cleared when the least significant byte lane (bits [7:0]) is read. */

/* Bit 1 - Counter stop rollover */
#define ETH_CSR (1 << 1)
/* 
When this bit is set, the counter does not roll over to zero after it reaches the maximum value. */

/* Bit 0 - Counter reset */
#define ETH_CR (1 << 0)
/* 
When it is set, all counters are reset. This bit is cleared automatically after 1 clock cycle. */

/* Ethernet MMC receive interrupt register */
#define STM32F_ETH_MMCRIR 0x0104



/* [31..18] Reserved */


/* Bit 17 - Received Good Unicast Frames Status */
#define ETH_RGUFS (1 << 17)
/* 
This bit is set when the received, good unicast frames, counter reaches half the maximum
value. */

/* [16..7] Reserved */


/* Bit 6 - Received frames alignment error status */
#define ETH_RFAES (1 << 6)
/* 
This bit is set when the received frames, with alignment error, counter reaches half the
maximum value. */

/* Bit 5 - Received frames CRC error status */
#define ETH_RFCES (1 << 5)
/* 
This bit is set when the received frames, with CRC error, counter reaches half the maximum
value. */

/* [4..0] Reserved */


/* Ethernet MMC transmit interrupt register */
#define STM32F_ETH_MMCTIR 0x0108



/* [31..22] Reserved */


/* Bit 21 - Transmitted good frames status */
#define ETH_TGFS (1 << 21)
/* 
This bit is set when the transmitted, good frames, counter reaches half the maximum value. */

/* [20..16] Reserved */


/* Bit 15 - Transmitted good frames more single collision status */
#define ETH_TGFMSCS (1 << 15)
/* 
This bit is set when the transmitted, good frames after more than a single collision, counter
reaches half the maximum value. */

