bobmittmann/thinkos/sdk/include/stm32f/stm32f-eth.h
/* Bit 14 - Transmitted good frames single collision status */
#define ETH_TGFSCS (1 << 14)
/* 
This bit is set when the transmitted, good frames after a single collision, counter reaches half
the maximum value. */

/* [13..0] Reserved */


/* Ethernet MMC receive interrupt mask register */
#define STM32F_ETH_MMCRIMR 0x010C



/* [31..18] Reserved */


/* Bit 17 - Received good unicast frames mask */
#define ETH_RGUFM (1 << 17)
/* 
Setting this bit masks the interrupt when the received, good unicast frames, counter reaches
half the maximum value. */

/* [16..7] Reserved */


/* Bit 6 - Received frames alignment error mask */
#define ETH_RFAEM (1 << 6)
/* Setting this bit masks the interrupt when the received frames, with
 * alignment error, counter reaches half the maximum value. */

/* Bit 5 - Received frame CRC error mask */
#define ETH_RFCEM (1 << 5)
/* Setting this bit masks the interrupt when the received frames, with CRC
 * error, counter reaches half the maximum value. */

/* [4..0] Reserved */


/* Ethernet MMC transmit interrupt mask register */
#define STM32F_ETH_MMCTIMR 0x0110



/* [31..22] Reserved */


/* Bit 21 - Transmitted good frames mask */
#define ETH_TGFM (1 << 21)
/* Setting this bit masks the interrupt when the transmitted, good frames, counter reaches half
the maximum value. */

/* [20..16] Reserved */


/* Bit 15 - Transmitted good frames more single collision mask */
#define ETH_TGFMSCM (1 << 15)
/* Setting this bit masks the interrupt when the transmitted good frames after more than a single
collision counter reaches half the maximum value. */

/* Bit 14 - Transmitted good frames single collision mask */
#define ETH_TGFSCM (1 << 14)
/* Setting this bit masks the interrupt when the transmitted good frames after a single collision
counter reaches half the maximum value. */

/* [13..0] Reserved */

/* Ethernet MMC transmitted good frames after a single collision counter register */
#define STM32F_ETH_MMCTGFSCCR 0x014C

/* Bits [31..0] - Transmitted good frames single collision counter */
#define ETH_TGFSCC ((31 - 0) << 0)
/* Transmitted good frames after a single collision counter.
 * Ethernet MMC transmitted good frames after more than a single collision
 */

/* counter register */
#define STM32F_ETH_MMCTGFMSCCR 0x0150



/* Bits [31..0] - Transmitted good frames more single collision counter */
#define ETH_TGFMSCC ((31 - 0) << 0)
/* Transmitted good frames after more than a single collision counter */

/* Ethernet MMC transmitted good frames counter register */
#define STM32F_ETH_MMCTGFCR 0x0168



/* Bits [31..0] - Transmitted good frames counter */
#define ETH_TGFC ((31 - 0) << 0)

/* Ethernet MMC received frames with CRC error counter register */
#define STM32F_ETH_MMCRFCECR 0x0194


/* Bits [31..0] - Received frames CRC error counter */
#define ETH_RFCEC ((31 - 0) << 0)
/* Received frames with CRC error counter */

/* Ethernet MMC received frames with alignment error counter register */
#define STM32F_ETH_MMCRFAECR 0x0198


/* Bits [31..0] - Received frames alignment error counter */
#define ETH_RFAEC ((31 - 0) << 0)
/* 
Received frames with alignment error counter */

/* MMC received good unicast frames counter register */
#define STM32F_ETH_MMCRGUFCR 0x01C4

/* Bits [31..0] - Received good unicast frames counter */
#define ETH_RGUFC ((31 - 0) << 0)

/* EEE 1588 time stamp registers
 * This section describes the registers required to support precision network
 * clock synchronization functions under the IEEE 1588 standard. */

/* Ethernet PTP time stamp control register */
#define STM32F_ETH_PTPTSCR 0x0700


/* [31..19] Reserved */

/* Bit 18 - Time stamp PTP frame filtering MAC address enable */
#define ETH_TSPFFMAE (1 << 18)
/* When set, this bit uses the MAC address (except for MAC address 0) to
 * filter the PTP frames when PTP is sent directly over Ethernet. */

/* Bits [17..16] - Time stamp clock node type */
#define ETH_TSCNT ((17 - 16) << 16)
/* The following are the available types of clock node:
 00: Ordinary clock
 01: Boundary clock
 10: End-to-end transparent clock
 11: Peer-to-peer transparent clock */

/* Bit 15 - Time stamp snapshot for message relevant to master enable */
#define ETH_TSSMRME (1 << 15)
/* When this bit is set, the snapshot is taken for messages relevant to the
 * master node only. When this bit is cleared the snapshot is taken for
 * messages relevant to the slave node only.
 * This is valid only for the ordinary clock and boundary clock nodes.
 */

/* Bit 14 - Time stamp snapshot for event message enable */
#define ETH_TSSEME (1 << 14)
/* When this bit is set, the time stamp snapshot is taken for event messages
 * only (SYNC, Delay_Req, Pdelay_Req or Pdelay_Resp). When this bit is cleared
 * the snapshot is taken for all other messages except for Announce,
 * Management and Signaling.
 */


/* Bit 13 - Time stamp snapshot for IPv4 frames enable */
#define ETH_TSSIPV4FE (1 << 13)
/* When this bit is set, the time stamp snapshot is taken for IPv4 frames. */

/* Bit 12 - Time stamp snapshot for IPv6 frames enable */
#define ETH_TSSIPV6FE (1 << 12)
/* When this bit is set, the time stamp snapshot is taken for IPv6 frames. */

/* Bit 11 - Time stamp snapshot for PTP over ethernet frames enable */
#define ETH_TSSPTPOEFE (1 << 11)
/* When this bit is set, the time stamp snapshot is taken for frames which have
 * PTP messages in Ethernet frames (PTP over Ethernet) also. By default
 * snapshots are taken for UDP-IPEthernet PTP packets.
 */

/* Bit 10 - Time stamp PTP packet snooping for version2 format enable */
#define ETH_TSPTPPSV2E (1 << 10)
/* When this bit is set, the PTP packets are snooped using the version 2
 * format. When the bit is cleared, the PTP packets are snooped using the
 * version 1 format.
 * Note: IEEE 1588 Version 1 and Version 2 formats as indicated in IEEE
 * standard 1588-2008 (Revision of IEEE STD. 1588-2002).
 */

/* Bit 9 - Time stamp subsecond rollover: digital or binary rollover control */
#define ETH_TSSSR (1 << 9)
/* When this bit is set, the Time stamp low register rolls over when the
 * subsecond counter reaches the value 0x3B9A C9FF (999 999 999 in decimal),
 * and increments the Time Stamp (high) seconds.
 * When this bit is cleared, the rollover value of the subsecond register
 * reaches 0x7FFF FFFF.
 * The subsecond increment has to be programmed correctly depending on the
 * PTPâ€™s reference clock frequency and this bit value.
 */

/* Bit 8 - Time stamp snapshot for all received frames enable */
#define ETH_TSSARFE (1 << 8)
/* When this bit is set, the time stamp snapshot is enabled for all frames
 * received by the core.
 */

/* [7..6] Reserved */


/* Bit 5 - Time stamp addend register update */
#define ETH_TSARU (1 << 5)
/* When this bit is set, the Time stamp addend registerâ€™s contents are
 * updated to the PTP block for fine correction. This bit is cleared when the
 * update is complete. This register bit must be
 * read as zero before you can set it.
 */


/* Bit 4 - Time stamp interrupt trigger enable */
#define ETH_TSITE (1 << 4)
/* When this bit is set, a time stamp interrupt is generated when the system
 * time becomes greater than the value written in the Target time register.
 *  When the Time stamp trigger interrupt is generated, this bit is cleared.
 */

/* Bit 3 - Time stamp system time update */
#define ETH_TSSTU (1 << 3)
/* 
When this bit is set, the system time is updated (added to or subtracted from) with the value
specified in the Time stamp high update and Time stamp low update registers. Both the
TSSTU and TSSTI bits must be read as zero before you can set this bit. Once the update is
completed in hardware, this bit is cleared. */

