bobmittmann/thinkos/sdk/include/stm32f/stm32f-eth.h
/* Bit 2 - Time stamp system time initialize */
#define ETH_TSSTI (1 << 2)
/* 
When this bit is set, the system time is initialized (overwritten) with the value specified in the
Time stamp high update and Time stamp low update registers. This bit must be read as zero
before you can set it. When initialization is complete, this bit is cleared. */

/* Bit 1 - Time stamp fine or coarse update */
#define ETH_TSFCU (1 << 1)
/* 
When set, this bit indicates that the system time stamp is to be updated using the Fine Update
method. When cleared, it indicates the system time stamp is to be updated using the Coarse
method. */

/* Bit 0 - Time stamp enable */
#define ETH_TSE (1 << 0)
/* 
When this bit is set, time stamping is enabled for transmit and receive frames. When this bit is
cleared, the time stamp function is suspended and time stamps are not added for transmit and
receive frames. Because the maintained system time is suspended, you must always initialize
the time stamp feature (system time) after setting this bit high. */

/* Ethernet PTP subsecond increment register */
#define STM32F_ETH_PTPSSIR 0x0704



/* [31..8] Reserved */


/* Bits [7..0] - System time subsecond increment */
#define ETH_STSSI ((7 - 0) << 0)
/* 
The value programmed in this register is added to the contents of the subsecond value of the
system time in every update.
For example, to achieve 20 ns accuracy, the value is: 20 / 0.467 = ~ 43 (or 0x2A). */

/* Ethernet PTP time stamp high register */
#define STM32F_ETH_PTPTSHR 0x0708


/* Bits [31..0] - System time second */
#define ETH_STS ((31 - 0) << 0)
/* 
The value in this field indicates the current value in seconds of the System Time maintained by
the core. */

/* Ethernet PTP time stamp low register */
#define STM32F_ETH_PTPTSLR 0x070C



/* Bit 31 - System time positive or negative sign */
#define ETH_STPNS (1 << 31)
/* 
This bit indicates a positive or negative time value. When set, the bit indicates that time
representation is negative. When cleared, it indicates that time representation is positive.
Because the system time should always be positive, this bit is normally zero. */

/* Bits [30..0] - System time subseconds */
#define ETH_STSS ((30 - 0) << 0)
/* 
The value in this field has the subsecond time representation, with 0.46 ns accuracy. */

/* Ethernet PTP time stamp high update register */
#define STM32F_ETH_PTPTSHUR 0x0710



/* Bits [31..0] - Time stamp update second */
#define ETH_TSUS ((31 - 0) << 0)
/* 
The value in this field indicates the time, in seconds, to be initialized or added to the system
time. */

/* Ethernet PTP time stamp low update register */
#define STM32F_ETH_PTPTSLUR 0x0714



/* Bit 31 - Time stamp update positive or negative sign */
#define ETH_TSUPNS (1 << 31)
/* 
This bit indicates positive or negative time value. When set, the bit indicates that time
representation is negative. When cleared, it indicates that time representation is positive.
When TSSTI is set (system time initialization) this bit should be zero. If this bit is set when
TSSTU is set, the value in the Time stamp update registers is subtracted from the system
time. Otherwise it is added to the system time. */

/* Bits [30..0] - Time stamp update subseconds */
#define ETH_TSUSS ((30 - 0) << 0)
/* 
The value in this field indicates the subsecond time to be initialized or added to the system
time. This value has an accuracy of 0.46 ns (in other words, a value of 0x0000_0001 is
0.46 ns). */

/* Ethernet PTP time stamp addend register */
#define STM32F_ETH_PTPTSAR 0x0718



/* Bits [31..0] - Time stamp addend */
#define ETH_TSA ((31 - 0) << 0)
/* 
This register indicates the 32-bit time value to be added to the Accumulator register to achieve
time synchronization. */

/* Ethernet PTP target time high register */
#define STM32F_ETH_PTPTTHR 0x071C



/* Bits [31..0] - Target time stamp high */
#define ETH_TTSH ((31 - 0) << 0)
/* 
This register stores the time in seconds. When the time stamp value matches or exceeds both
Target time stamp registers, the MAC, if enabled, generates an interrupt. */

/* Ethernet PTP target time low register */
#define STM32F_ETH_PTPTTLR 0x0720



/* Bits [31..0] - Target time stamp low */
#define ETH_TTSL ((31 - 0) << 0)
/* This register stores the time in (signed) nanoseconds. When the value of
 * the time stamp matches or exceeds both Target time stamp registers, the
 * MAC, if enabled, generates an interrupt. */


/* Ethernet PTP time stamp status register */
#define STM32F_ETH_PTPTSSR 0x0728


/* Bit 1 - Time stamp target time reached */
#define ETH_TSTTR (1 << 1)
/* When set, this bit indicates that the value of the system time is greater
 * than or equal to the value specified in the Target time high and low
 * registers
 */

/* Bit 0 - Time stamp second overflow */
#define ETH_TSSO (1 << 0)
/* When set, this bit indicates that the second value of the time stamp has
 * overflowed beyond 0xFFFF FFFF.
 */

/* Ethernet PTP PPS control register */
#define STM32F_ETH_PTPPPSCR 0x072C



/* [31..4] Reserved */


/* Bits [3..0] - PPS frequency selection */
#define ETH_PPSFREQ ((3 - 0) << 0)
/* 
The PPS output frequency is set to 2PPSFREQ Hz.
0000: 1 Hz with a pulse width of 125 ms for binary rollover and, of 100 ms for digital rollover
0001: 2 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)
0010: 4 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)
0011: 8 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)
0100: 16 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)
...
1111: 32768 Hz with 50% duty cycle for binary rollover (digital rollover not recommended)
Note: If digital rollover is used (TSSSR=1, bit 9 in ETH_PTPTSCR), it is recommended not to
use the PPS output with a frequency other than 1 Hz. Otherwise, with digital rollover,
the PPS output has irregular waveforms at higher frequencies (though its average
frequency will always be correct during any one-second window). */


/*-------------------------------------------------------------------------
 * Ethernet DMA bus mode register 
 */
#define STM32F_ETH_DMABMR 0x1000


