bobmittmann/thinkos/sdk/include/stm32f/stm32f-eth.h
/* Bits 31:267 Reserved */

/* Bit 26 - Mixed burst */
#define ETH_MB (1 << 26)
/* When this bit is set high and the FB bit is low, the AHB master interface 
   starts all bursts of a length greater than 16 with INCR (undefined burst). 
   When this bit is cleared, it reverts to fixed burst transfers 
   (INCRx and SINGLE) for burst lengths of 16 and below. */

/* Bit 25 - Address-aligned beats */
#define ETH_AAB (1 << 25)
/* When this bit is set high and the FB bit equals 1, the AHB interface 
   generates all bursts aligned to the start address LS bits. If the FB bit 
   equals 0, the first burst (accessing the data bufferâ€™s start address) is 
   not aligned, but subsequent bursts are aligned to the address. */

/* Bit 24 - 4xPBL mode */
#define ETH_FPM (1 << 24)
/* When set high, this bit multiplies the PBL value programmed 
   (bits [22:17] and bits [13:8]) four times. Thus the DMA transfers data in 
   a maximum of 4, 8, 16, 32, 64 and 128 beats depending on the PBL value. */

/* Bit 23 - Use separate PBL */
#define ETH_USP (1 << 23)
/* When set high, it configures the RxDMA to use the value configured in 
   bits [22:17] as PBL while the PBL value in bits [13:8] is applicable to 
   TxDMA operations only.
   When this bit is cleared, the PBL value in bits [13:8] is applicable 
   for both DMA engines. */

/* Bits [22..17] - Rx DMA PBL */
#define ETH_RDP ((22 - 17) << 17)
#define ETH_RDP_MSK (((1 << (5 + 1)) - 1) << 17)
#define ETH_RDP_SET(VAL) (((VAL) << 17) & ETH_RDP_MSK)
#define ETH_RDP_GET(REG) (((REG) & ETH_RDP_MSK) >> 17)
/* These bits indicate the maximum number of beats to be transferred in one 
   RxDMA transaction.
   This is the maximum value that is used in a single block read/write 
   operation. The RxDMA always attempts to burst as specified in RDP each 
   time it starts a burst transfer on the host bus. RDP can be programmed 
   with permissible values of 1, 2, 4, 8, 16, and 32. Any other value
   results in undefined behavior.
   These bits are valid and applicable only when USP is set high. */

/* Bit 16 - Fixed burst */
#define ETH_FB (1 << 16)
/* This bit controls whether the AHB Master interface performs fixed burst 
   transfers or not.
   When set, the AHB uses only SINGLE, INCR4, INCR8 or INCR16 during start 
   of normal burst transfers. 
   When reset, the AHB uses SINGLE and INCR burst transfer operations. */

/* Bits [15..14] - Rx Tx priority ratio */
#define ETH_RTPR ((15 - 14) << 14)
#define ETH_RTPR_MSK (((1 << (1 + 1)) - 1) << 14)
#define ETH_RTPR_SET(VAL) (((VAL) << 14) & ETH_RTPR_MSK)
#define ETH_RTPR_GET(REG) (((REG) & ETH_RTPR_MSK) >> 14)
/* RxDMA requests are given priority over TxDMA requests in 
   the following ratio:
   00: 1:1
   01: 2:1
   10: 3:1
   11: 4:1
   This is valid only when the DA bit is cleared. */

/* Bits [13..8] - Programmable burst length */
#define ETH_PBL ((13 - 8) << 8)
#define ETH_BPL_MSK (((1 << (5 + 1)) - 1) << 8)
#define ETH_BPL_SET(VAL) (((VAL) << 8) & ETH_BPL_MSK)
#define ETH_BPL_GET(REG) (((REG) & ETH_BPL_MSK) >> 8)
/* These bits indicate the maximum number of beats to be transferred in 
   one DMA transaction. 
   This is the maximum value that is used in a single block read/write 
   operation. The DMA always attempts to burst as specified in PBL each 
   time it starts a burst transfer on the host bus. PBL can be 
   programmed with permissible values of 1, 2, 4, 8, 16, and 32. Any 
   other value results in undefined behavior. When USP is set, this PBL 
   value is applicable for TxDMA transactions only.
   The PBL values have the following limitations:
   â€“ The maximum number of beats (PBL) possible is limited by the size 
   of the Tx FIFO and Rx FIFO.
   â€“ The FIFO has a constraint that the maximum beat supported is half 
   the depth of the FIFO.
   â€“ If the PBL is common for both transmit and receive DMA, the minimum 
   Rx FIFO and Tx FIFO depths must be considered.
   â€“ Do not program out-of-range PBL values, because the system may 
   not behave properly. */

/* Bit 7 - Enhanced descriptor format enable */
#define ETH_EDFE (1 << 7)
/* When this bit is set, the enhanced descriptor format is enabled and the 
   descriptor size is increased to 32 bytes (8 DWORDS). This is required when 
   time stamping is activated (TSE=1, ETH_PTPTSCR bit 0) or if IPv4 checksum 
   offload is activated (IPCO=1, ETH_MACCR bit 10). */

/* Bit 7 Reserved */


/* Bits [6..2] - Descriptor skip length */
#define ETH_DSL ((6 - 2) << 2)
#define ETH_DSL_MSK (((1 << (4 + 1)) - 1) << 2)
#define ETH_DSL_SET(VAL) (((VAL) << 2) & ETH_DSL_MSK)
#define ETH_DSL_GET(REG) (((REG) & ETH_DSL_MSK) >> 2)
/* This bit specifies the number of words to skip between two unchained 
   descriptors. The address skipping starts from the end of current descriptor 
   to the start of next descriptor. When DSL value equals zero, the descriptor 
   table is taken as contiguous by the DMA, in Ring mode. */

/* Bit 1 - DMA Arbitration */
#define ETH_DA (1 << 1)
/* 0: Round-robin with Rx:Tx priority given in bits [15:14]
   1: Rx has priority over Tx */

/* Bit 0 - Software reset */
#define ETH_SRST (1 << 0)
/* When this bit is set, the MAC DMA controller resets all MAC Subsystem 
   internal registers and logic. It is cleared automatically after the reset 
   operation has completed in all of the core clock domains. Read a 0 value 
   in this bit before re-programming any register of the core. */

/*-------------------------------------------------------------------------
 * Ethernet DMA transmit poll demand register 
 */
#define STM32F_ETH_DMATPDR 0x1004

/* Bits [31..0] - Transmit poll demand */
#define ETH_TPD ((31 - 0) << 0)
/* When these bits are written with any value, the DMA reads the current 
   descriptor pointed to by the ETH_DMACHTDR register. If that descriptor is 
   not available (owned by Host), transmission returns to the Suspend state 
   and ETH_DMASR register bit 2 is asserted. If the descriptor is available, 
   transmission resumes. */


/*-------------------------------------------------------------------------
 * EHERNET DMA receive poll demand register
 */
#define STM32F_ETH_DMARPDR 0x1008

/* Bits [31..0] - Receive poll demand */
#define ETH_RPD ((31 - 0) << 0)
/* When these bits are written with any value, the DMA reads the current 
   descriptor pointed to by the ETH_DMACHRDR register. If that descriptor 
   is not available (owned by Host), reception returns to the Suspended 
   state and ETH_DMASR register bit 7 is not asserted. If the descriptor 
   is available, the Receive DMA returns to active state. */


/*-------------------------------------------------------------------------
 * Ethernet DMA receive descriptor list address register 
 */
#define STM32F_ETH_DMARDLAR 0x100C

/* Bits [31..0] - Start of receive list */
#define ETH_SRL ((31 - 0) << 0)
/* This field contains the base address of the first descriptor in the 
   receive descriptor list. The LSB bits [1/2/3:0] for 32/64/128-bit 
   bus width) are internally ignored and taken as all-zero by the DMA. 
   Hence these LSB bits are read only. */


/*-------------------------------------------------------------------------
 * Ethernet DMA transmit descriptor list address register 
 */
#define STM32F_ETH_DMATDLAR 0x1010

