bobmittmann/thinkos/sdk/include/stm32f/stm32f-eth.h
/* Bits [31..0] - Start of transmit list */
#define ETH_STL ((31 - 0) << 0)
/* This field contains the base address of the first descriptor in the 
   transmit descriptor list. The LSB bits [1/2/3:0] for 32/64/128-bit 
   bus width) are internally ignored and taken as all-zero by the DMA. 
   Hence these LSB bits are read-only. */


/*-------------------------------------------------------------------------
 * Ethernet DMA status register
 */
#define STM32F_ETH_DMASR 0x1014

/* [31..30] Reserved */

/* Bit 29 - Time stamp trigger status */
#define ETH_DMA_TSTS (1 << 29)
/* This bit indicates an interrupt event in the MAC core's Time stamp 
 * generator block. The software must read the MAC coreâ€™s status 
 * register, clearing its source (bit 9), to reset this bit to 0.
 * When this bit is high an interrupt is generated if enabled. */

/* Bit 28 - PMT status */
#define ETH_DMA_PMTS (1 << 28)
/* This bit indicates an event in the MAC coreâ€™s PMT. The software must 
 * read the corresponding registers in the MAC core to get the exact cause 
 * of interrupt and clear its source to reset this bit to 0. The interrupt 
 * is generated when this bit is high if enabled. */

/* Bit 27 - MMC status */
#define ETH_DMA_MMCS (1 << 27)
/* This bit reflects an event in the MMC of the MAC core. The software must 
 * read the corresponding registers in the MAC core to get the exact cause 
 * of interrupt and clear the source of interrupt to make this bit as 0. 
 * The interrupt is generated when this bit is high if enabled. */

/* Bit 26 Reserved */


/* Bits [25..23] - Error bits status */
#define ETH_EBS (((1 << (25 - 23 + 1)) - 1) << 23)
#define ETH_EBS_MSK (((1 << (25 - 23 + 1)) - 1) << 23)
#define ETH_EBS_SET(VAL) (((VAL) << 23) & ETH_EBS_MSK)
#define ETH_EBS_GET(REG) (((REG) & ETH_EBS_MSK) >> 23)
/* These bits indicate the type of error that caused a bus error (error 
 * response on the AHB interface). Valid only with the fatal bus error 
 * bit (ETH_DMASR register [13]) set. This field does not generate an 
 * interrupt.
 * Bit 23
 * 1 - Error during data transfer by TxDMA
 * 0 - Error during data transfer by RxDMA
 * Bit 24
 * 1 - Error during read transfer
 * 0 - Error during write transfer
 * Bit 25
 * 1 - Error during descriptor access
 * 0 - Error during data buffer access */

/* Bits [22..20] - Transmit process state */
#define ETH_TPS ((22 - 20) << 20)
/* These bits indicate the Transmit DMA FSM state. This field does not 
 * generate an interrupt.
 * 000: Stopped; Reset or Stop Transmit Command issued
 * 001: Running; Fetching transmit transfer descriptor
 * 010: Running; Waiting for status
 * 011: Running; Reading Data from host memory buffer and queuing it to 
 * transmit buffer (Tx FIFO)
 * 100, 101: Reserved for future use
 * 110: Suspended; Transmit descriptor unavailable or transmit buffer underflow
 * 111: Running; Closing transmit descriptor */

/* Bits [19..17] - Receive process state */
#define ETH_RPS (((1 << (19 - 17 + 1)) - 1) << 17)
#define ETH_RPS_MSK (((1 << (19 - 17 + 1)) - 1) << 17)
#define ETH_RPS_SET(VAL) (((VAL) << 17) & ETH_RPS_MSK)
#define ETH_RPS_GET(REG) (((REG) & ETH_RPS_MSK) >> 17)
/* These bits indicate the Receive DMA FSM state. This field does not 
 * generate an interrupt.
 * 000: Stopped: Reset or Stop Receive Command issued
 * 001: Running: Fetching receive transfer descriptor
 * 010: Reserved for future use
 * 011: Running: Waiting for receive packet
 * 100: Suspended: Receive descriptor unavailable
 * 101: Running: Closing receive descriptor
 * 110: Reserved for future use
 * 111: Running: Transferring the receive packet data from receive buffer to 
 * host memory */

/* Bit 16 - Normal interrupt summary */
#define ETH_NIS (1 << 16)
/* The normal interrupt summary bit value is the logical OR of the 
 * following when the corresponding interrupt bits are enabled in the 
 * ETH_DMAIER register:
 * â€“ ETH_DMASR [0]: Transmit interrupt
 * â€“ ETH_DMASR [2]: Transmit buffer unavailable
 * â€“ ETH_DMASR [6]: Receive interrupt
 * â€“ ETH_DMASR [14]: Early receive interrupt
 * Only unmasked bits affect the normal interrupt summary bit.
 * This is a sticky bit and it must be cleared (by writing a 1 to this 
 * bit) each time a corresponding bit that causes NIS to be set is cleared. */

/* Bit 15 - Abnormal interrupt summary */
#define ETH_AIS (1 << 15)
/* The abnormal interrupt summary bit value is the logical OR of the 
 * following when the corresponding interrupt bits are enabled in the 
 * ETH_DMAIER register:
 * â€“ ETH_DMASR [1]: Transmit process stopped
 * â€“ ETH_DMASR [3]: Transmit jabber timeout
 * â€“ ETH_DMASR [4]: Receive FIFO overflow
 * â€“ ETH_DMASR [5]: Transmit underflow
 * â€“ ETH_DMASR [7]: Receive buffer unavailable
 * â€“ ETH_DMASR [8]: Receive process stopped
 * â€“ ETH_DMASR [9]: Receive watchdog timeout
 * â€“ ETH_DMASR [10]: Early transmit interrupt
 * â€“ ETH_DMASR [13]: Fatal bus error
 * Only unmasked bits affect the abnormal interrupt summary bit.
 * This is a sticky bit and it must be cleared each time a corresponding 
 * bit that causes AIS to be set is cleared. */

/* Bit 14 - Early receive status */
#define ETH_ERS (1 << 14)
/* This bit indicates that the DMA had filled the first data buffer of 
 * the packet. Receive Interrupt ETH_DMASR [6] automatically clears 
 * this bit. */

/* Bit 13 - Fatal bus error status */
#define ETH_FBES (1 << 13)
/* This bit indicates that a bus error occurred, as detailed in [25:23]. 
 * When this bit is set, the corresponding DMA engine disables all its 
 * bus accesses. */

/* [12..11] Reserved */

/* Bit 10 - Early transmit status */
#define ETH_ETS (1 << 10)
/* This bit indicates that the frame to be transmitted was fully 
 * transferred to the Transmit FIFO. */

/* Bit 9 - Receive watchdog timeout status */
#define ETH_RWTS (1 << 9)
/* This bit is asserted when a frame with a length greater than 
 * 2 048 bytes is received. */

/* Bit 8 - Receive process stopped status */
#define ETH_RPSS (1 << 8)
/* This bit is asserted when the receive process enters the Stopped state. */

/* Bit 7 - Receive buffer unavailable status */
#define ETH_RBUS (1 << 7)
/* This bit indicates that the next descriptor in the receive list is owned 
 * by the host and cannot be acquired by the DMA. Receive process 
 * is suspended. To resume processing receive descriptors, the host should 
 * change the ownership of the descriptor and issue a Receive Poll Demand 
 * command. If no Receive Poll Demand is issued, receive process resumes 
 * when the next recognized incoming frame is received. ETH_DMASR [7] is 
 * set only when the previous receive descriptor was owned by the DMA. */

