bobmittmann/thinkos/sdk/include/stm32f/stm32f-eth.h
/* Bit 6 - Receive status */
#define ETH_RS (1 << 6)
/* This bit indicates the completion of the frame reception. Specific frame 
 * status information has been posted in the descriptor. Reception 
 * remains in the Running state. */

/* Bit 5 - Transmit underflow status */
#define ETH_TUS (1 << 5)
/* This bit indicates that the transmit buffer had an underflow during frame
 * transmission. Transmission is suspended and an underflow error
 * TDES0[1] is set.
 */

/* Bit 4 - Receive overflow status */
#define ETH_ROS (1 << 4)
/* This bit indicates that the receive buffer had an overflow during frame
 * reception. If the partial frame is transferred to the application, the
 * overflow status is set in RDES0[11].
 */

/* Bit 3 - Transmit jabber timeout status */
#define ETH_TJTS (1 << 3)
/* This bit indicates that the transmit jabber timer expired, meaning that
 * the transmitter had been excessively active. The transmission process is
 * aborted and placed in the Stopped state. This causes the transmit jabber
 * timeout TDES0[14] flag to be asserted.
 */

/* Bit 2 - Transmit buffer unavailable status */
#define ETH_TBUS (1 << 2)
/* This bit indicates that the next descriptor in the transmit list is owned
 * by the host and cannot be acquired by the DMA. Transmission is suspended.
 * Bits [22:20] explain the transmit process state transitions. To resume
 * processing transmit descriptors, the host should change the ownership of
 * the bit of the descriptor and then issue a Transmit Poll Demand command.
 */

/* Bit 1 - Transmit process stopped status */
#define ETH_TPSS (1 << 1)
/* This bit is set when the transmission is stopped.
 */

/* Bit 0 - Transmit status */
#define ETH_TS (1 << 0)
/* This bit indicates that frame transmission is finished and TDES1[31] is
 * set in the first descriptor.
 */

/*-------------------------------------------------------------------------
 * Ethernet DMA operation mode register 
 */
#define STM32F_ETH_DMAOMR 0x1018


/* [31..27] Reserved */


/* Bit 26 - Dropping of TCP/IP checksum error frames disable */
#define ETH_DTCEFD (1 << 26)
/* When this bit is set, the core does not drop frames that only have errors
 * detected by the receive checksum offload engine. Such frames do not have
 * any errors (including FCS error) in the Ethernet frame received by the
 * MAC but have errors in the encapsulated payload only.
 * When this bit is cleared, all error frames are dropped if the FEF bit
 * is reset.
 */

/* Bit 25 - Receive store and forward */
#define ETH_RSF (1 << 25)
/* When this bit is set, a frame is read from the Rx FIFO after the 
   complete frame has been written to it, ignoring RTC bits. 
   When this bit is cleared, the Rx FIFO operates in Cut-through mode, 
   subject to the threshold specified by the RTC bits. */

/* Bit 24 - Disable flushing of received frames */
#define ETH_DFRF (1 << 24)
/* When this bit is set, the RxDMA does not flush any frames due to the 
 * unavailability of receive descriptors/buffers as it does normally when 
 * this bit is cleared. (See Receive process suspended on page 860) */

/* [23..22] Reserved */


/* Bit 21 - Transmit store and forward */
#define ETH_TSF (1 << 21)
/* When this bit is set, transmission starts when a full frame resides in 
 * the Transmit FIFO. When this bit is set, the TTC values specified by 
 * the ETH_DMAOMR register bits [16:14] are ignored. When this bit is 
 * cleared, the TTC values specified by the ETH_DMAOMR register 
 * bits [16:14] are taken into account.
 * This bit should be changed only when transmission is stopped. */

/* Bit 20 - Flush transmit FIFO */
#define ETH_FTF (1 << 20)
/* When this bit is set, the transmit FIFO controller logic is reset to its 
 * default values and thus all data in the Tx FIFO are lost/flushed. This 
 * bit is cleared internally when the flushing operation is complete. 
 * The Operation mode register should not be written to until this 
 * bit is cleared. */

/* [19..17] Reserved */


/* Bits [16..14] - Transmit threshold control */
#define ETH_TTC ((16 - 14) << 14)
/* These three bits control the threshold level of the Transmit FIFO. 
 * Transmission starts when the frame size within the Transmit FIFO is 
 * larger than the threshold. In addition, full frames with a length less 
 * than the threshold are also transmitted. These bits are used only when 
 * the TSF bit (Bit 21) is cleared.
 * 000: 64
 * 001: 128
 * 010: 192
 * 011: 256
 * 100: 40
 * 101: 32
 * 110: 24
 * 111: 16 */

/* Bit 13 - Start/stop transmission */
#define ETH_ST (1 << 13)
/* When this bit is set, transmission is placed in the Running state, and 
 * the DMA checks the transmit list at the current position for a frame 
 * to be transmitted. Descriptor acquisition is attempted either from 
 * the current position in the list, which is the transmit list base 
 * address set by the ETH_DMATDLAR register, or from the position retained 
 * when transmission was stopped previously. If the current descriptor is 
 * not owned by the DMA, transmission enters the Suspended state and the 
 * transmit buffer unavailable bit (ETH_DMASR [2]) is set. The Start 
 * Transmission command is effective only when transmission is stopped. If 
 * the command is issued before setting the DMA ETH_DMATDLAR register, the 
 * DMA behavior is unpredictable.
 * When this bit is cleared, the transmission process is placed in the 
 * Stopped state after completing the transmission of the current frame. 
 * The next descriptor position in the transmit list is saved, and becomes 
 * the current position when transmission is restarted. The Stop 
 * Transmission command is effective only when the transmission of the 
 * current frame is complete or when the transmission is in the 
 * Suspended state. */

/* [12..8] Reserved */


/* Bit 7 - Forward error frames */
#define ETH_FEF (1 << 7)
/* When this bit is set, all frames except runt error frames are forwarded 
 * to the DMA.
 * When this bit is cleared, the Rx FIFO drops frames with error status 
 * (CRC error, collision error, giant frame, watchdog timeout, overflow). 
 * However, if the frameâ€™s start byte (write) pointer is already 
 * transferred to the read controller side (in Threshold mode), then the 
 * frames are not dropped. The Rx FIFO drops the error frames if that 
 * frame's start byte is not transferred (output) on the ARI bus. */

/* Bit 6 - Forward undersized good frames */
#define ETH_FUGF (1 << 6)
/* When this bit is set, the Rx FIFO forwards undersized frames (frames \
 * with no error and length less than 64 bytes) including pad-bytes and CRC).
 * When this bit is cleared, the Rx FIFO drops all frames of less than 
 * 64 bytes, unless such a frame has already been transferred due to lower 
 * value of receive threshold (e.g., RTC = 01). */

/* Bit 5 Reserved */


