bobmittmann/thinkos/sdk/include/stm32f/stm32f-eth.h
/* Bits [4..3] - Receive threshold control */
#define ETH_RTC ((4 - 3) << 3)
/* These two bits control the threshold level of the Receive FIFO. Transfer 
 * (request) to DMA starts when the frame size within the Receive FIFO 
 * is larger than the threshold. In addition, full frames with a length 
 * less than the threshold are transferred automatically.
 * Note: Note that value of 11 is not applicable if the configured Receive 
 * FIFO size is 128 bytes.
 * Note: These bits are valid only when the RSF bit is zero, and are 
 * ignored when the RSF bit is set to 1.
 * 00: 64
 * 01: 32
 * 10: 96
 * 11: 128 */

/* Bit 2 - Operate on second frame */
#define ETH_OSF (1 << 2)
/* When this bit is set, this bit instructs the DMA to process a second
 * frame of Transmit data even before status for first frame is obtained.
 */

/* Bit 1 - Start/stop receive */
#define ETH_SR (1 << 1)
/* When this bit is set, the receive process is placed in the Running state.
 * The DMA attempts to acquire the descriptor from the receive list and
 * processes incoming frames. Descriptor acquisition is attempted from the
 * current position in the list, which is the address set by the
 * DMA ETH_DMARDLAR register or the position retained when the receive process
 * was previously stopped. If no descriptor is owned by the DMA, reception is
 * suspended and the receive buffer unavailable bit (ETH_DMASR [7]) is set.
 * The Start Receive command is effective only when reception has stopped.
 * If the command was issued before setting the DMA ETH_DMARDLAR register,
 * the DMA behavior is unpredictable.
 * When this bit is cleared, RxDMA operation is stopped after the transfer of
 * the current frame. The next descriptor position in the receive list is
 * saved and becomes the current position when the receive process is
 * restarted. The Stop Receive command is effective only when the Receive
 * process is in either the Running (waiting for receive packet) or
 * the Suspended state.
 */

/* Bit 0 Reserved */

/* Ethernet DMA interrupt enable register */
#define STM32F_ETH_DMAIER 0x101C


/* [31..17] Reserved */

/* Bit 16 - Normal interrupt summary enable */
#define ETH_NISE (1 << 16)
/* When this bit is set, a normal interrupt is enabled. When this bit is 
   cleared, a normal interrupt is disabled. This bit enables 
   the following bits:
   â€“ ETH_DMASR [0]: Transmit Interrupt
   â€“ ETH_DMASR [2]: Transmit buffer unavailable
   â€“ ETH_DMASR [6]: Receive interrupt
   â€“ ETH_DMASR [14]: Early receive interrupt */

/* Bit 15 - Abnormal interrupt summary enable */
#define ETH_AISE (1 << 15)
/* When this bit is set, an abnormal interrupt is enabled. When this 
   bit is cleared, an abnormal interrupt is disabled. This bit enables 
   the following bits:
   â€“ ETH_DMASR [1]: Transmit process stopped
   â€“ ETH_DMASR [3]: Transmit jabber timeout
   â€“ ETH_DMASR [4]: Receive overflow
   â€“ ETH_DMASR [5]: Transmit underflow
   â€“ ETH_DMASR [7]: Receive buffer unavailable
   â€“ ETH_DMASR [8]: Receive process stopped
   â€“ ETH_DMASR [9]: Receive watchdog timeout
   â€“ ETH_DMASR [10]: Early transmit interrupt
   â€“ ETH_DMASR [13]: Fatal bus error */

/* Bit 14 - Early receive interrupt enable */
#define ETH_ERIE (1 << 14)
/* When this bit is set with the normal interrupt summary enable bit 
   (ETH_DMAIER register[16]), the early receive interrupt is enabled.
   When this bit is cleared, the early receive interrupt is disabled. */

/* Bit 13 - Fatal bus error interrupt enable */
#define ETH_FBEIE (1 << 13)
/* When this bit is set with the abnormal interrupt summary enable bit 
   (ETH_DMAIER register[15]), the fatal bus error interrupt is enabled.
   When this bit is cleared, the fatal bus error enable interrupt 
   is disabled. */

/* [12..11] Reserved */


/* Bit 10 - Early transmit interrupt enable */
#define ETH_ETIE (1 << 10)
/* When this bit is set with the abnormal interrupt summary enable bit 
   (ETH_DMAIER register [15]), the early transmit interrupt is enabled.
   When this bit is cleared, the early transmit interrupt is disabled. */

/* Bit 9 - receive watchdog timeout interrupt enable */
#define ETH_RWTIE (1 << 9)
/* When this bit is set with the abnormal interrupt summary enable bit 
   (ETH_DMAIER register[15]), the receive watchdog timeout interrupt 
   is enabled.
   When this bit is cleared, the receive watchdog timeout interrupt 
   is disabled. */

/* Bit 8 - Receive process stopped interrupt enable */
#define ETH_RPSIE (1 << 8)
/* When this bit is set with the abnormal interrupt summary enable bit 
   (ETH_DMAIER register[15]), the receive stopped interrupt is enabled. 
   When this bit is cleared, the receive stopped interrupt is disabled. */

/* Bit 7 - Receive buffer unavailable interrupt enable */
#define ETH_RBUIE (1 << 7)
/* When this bit is set with the abnormal interrupt summary enable bit 
   (ETH_DMAIER register[15]), the receive buffer unavailable interrupt is 
   enabled.
   When this bit is cleared, the receive buffer unavailable interrupt 
   is disabled. */

/* Bit 6 - Receive interrupt enable */
#define ETH_RIE (1 << 6)
/* When this bit is set with the normal interrupt summary enable bit 
   (ETH_DMAIER register[16]), the receive interrupt is enabled.
   When this bit is cleared, the receive interrupt is disabled. */

/* Bit 5 - Underflow interrupt enable */
#define ETH_TUIE (1 << 5)
/* When this bit is set with the abnormal interrupt summary enable bit 
   (ETH_DMAIER register[15]), the transmit underflow interrupt is enabled.
   When this bit is cleared, the underflow interrupt is disabled. */

/* Bit 4 - Overflow interrupt enable */
#define ETH_ROIE (1 << 4)
/* When this bit is set with the abnormal interrupt summary enable bit 
   (ETH_DMAIER register[15]), the receive overflow interrupt is enabled.
   When this bit is cleared, the overflow interrupt is disabled. */

/* Bit 3 - Transmit jabber timeout interrupt enable */
#define ETH_TJTIE (1 << 3)
/* When this bit is set with the abnormal interrupt summary enable bit 
   (ETH_DMAIER register[15]), the transmit jabber timeout interrupt 
   is enabled.
   When this bit is cleared, the transmit jabber timeout 
   interrupt is disabled. */

