bobmittmann/thinkos/sdk/include/stm32f/stm32f-eth.h
/* Bit 2 - Transmit buffer unavailable interrupt enable */
#define ETH_TBUIE (1 << 2)
/* When this bit is set with the normal interrupt summary enable 
   bit (ETH_DMAIER register[16]), the transmit buffer unavailable interrupt 
   is enabled.
   When this bit is cleared, the transmit buffer unavailable 
   interrupt is disabled. */

/* Bit 1 - Transmit process stopped interrupt enable */
#define ETH_TPSIE (1 << 1)
/* When this bit is set with the abnormal interrupt summary enable bit 
   (ETH_DMAIER register[15]), the transmission stopped interrupt is 
   enabled.
   When this bit is cleared, the transmission stopped interrupt is disabled. */

/* Bit 0 - Transmit interrupt enable */
#define ETH_TIE (1 << 0)
/* When this bit is set with the normal interrupt summary enable bit 
   (ETH_DMAIER register[16]), the transmit interrupt is enabled.
   When this bit is cleared, the transmit interrupt is disabled. */

/* Ethernet DMA missed frame and buffer overflow counter register */
#define STM32F_ETH_DMAMFBOCR 0x1020

/* [31..29] Reserved */

/* Bit 28 - Overflow bit for FIFO overflow counter */
#define ETH_OFOC (1 << 28)

/* Bits [27..17] - Missed frames by the application */
#define ETH_MFA ((27 - 17) << 17)
/* Indicates the number of frames missed by the application */

/* Bit 16 - Overflow bit for missed frame counter */
#define ETH_OMFC (1 << 16)

/* Bits [15..0] - Missed frames by the controller */
#define ETH_MFC ((15 - 0) << 0)
/* Indicates the number of frames missed by the Controller due to the 
   host receive buffer being unavailable. This counter is incremented 
   each time the DMA discards an incoming frame. */


/* Ethernet DMA receive status watchdog timer register */
#define STM32F_ETH_DMARSWTR 0x1024

/* [31..8] Reserved */

/* Bits [7..0] - Receive status (RS) watchdog timer count */
#define ETH_RSWTC ((7 - 0) << 0)
/* Indicates the number of HCLK clock cycles multiplied by 256 for which 
   the watchdog timer is set. The watchdog timer gets triggered with the 
   programmed value after the RxDMA completes the transfer of a frame for 
   which the RS status bit is not set due to the setting of RDES1[31] in 
   the corresponding descriptor. When the watchdog timer runs out, the RS 
   bit is set and the timer is stopped. The watchdog timer is reset when 
   the RS bit is set high due to automatic setting of RS as per 
   RDES1[31] of any received frame. */

/* Ethernet DMA current host transmit descriptor register */
#define STM32F_ETH_DMACHTDR 0x1048

/* Bits [31..0] - Host transmit descriptor address pointer */
#define ETH_HTDAP ((31 - 0) << 0)
/* Cleared on reset. Pointer updated by DMA during operation. */


/* Ethernet DMA current host receive descriptor register */
#define STM32F_ETH_DMACHRDR 0x104C

/* Bits [31..0] - Host receive descriptor address pointer */
#define ETH_HRDAP ((31 - 0) << 0)
/* Cleared on Reset. Pointer updated by DMA during operation. */


/* Ethernet DMA current host transmit buffer address register */
#define STM32F_ETH_DMACHTBAR 0x1050

/* Bits [31..0] - Host transmit buffer address pointer */
#define ETH_HTBAP ((31 - 0) << 0)
/* Cleared on reset. Pointer updated by DMA during operation. */


/* Ethernet DMA current host receive buffer address register */
#define STM32F_ETH_DMACHRBAR 0x1054

/* Bits [31..0] - Host receive buffer address pointer */
#define ETH_HRBAP ((31 - 0) << 0)
/* Cleared on reset. Pointer updated by DMA during operation. */


/* Normal Rx DMA descriptors */

/* Bit 31 - Own bit */
#define ETH_RXDMA_OWN (1 << 31)
/* When set, this bit indicates that the descriptor is owned by the DMA of 
   the MAC Subsystem. When this bit is reset, it indicates that the 
   descriptor is owned by the Host. The DMA clears this bit either 
   when it completes the frame reception or when the buffers that are 
   associated with this descriptor are full. */

/* Bit 30 - Destination address filter fail */
#define ETH_RXDMA_AFM (1 << 30)
/* When set, this bit indicates a frame that failed the DA filter in 
   the MAC Core. */

/* Bits [29..16] - Frame length */
#define ETH_RXDMA_FL ((29 - 16) << 16)
/* These bits indicate the byte length of the received frame that was 
   transferred to host memory (including CRC). This field is valid only 
   when last descriptor (RDES0[8]) is set and descriptor error 
   (RDES0[14]) is reset.
   This field is valid when last descriptor (RDES0[8]) is set. When the 
   last descriptor and error summary bits are not set, this field 
   indicates the accumulated number of bytes that have been 
   transferred for the current frame. */

/* Bit 15 - Error summary */
#define ETH_RXDMA_ES (1 << 15)
/* Indicates the logical OR of the following bits:
   â€“ RDES0[1]: CRC error
   â€“ RDES0[3]: Receive error
   â€“ RDES0[4]: Watchdog timeout
   â€“ RDES0[6]: Late collision
   â€“ RDES0[7]: Giant frame (This is not applicable when RDES0[7] 
   indicates an IPV4 header checksum error.)
   â€“ RDES0[11]: Overflow error
   â€“ RDES0[14]: Descriptor error.
   This field is valid only when the last descriptor (RDES0[8]) is set. */

/* Bit 14 - Descriptor error */
#define ETH_RXDMA_DSE (1 << 14)
/* When set, this bit indicates a frame truncation caused by a frame that 
   does not fit within the current descriptor buffers, and that the DMA 
   does not own the next descriptor. The frame is truncated. This field 
   is valid only when the last descriptor (RDES0[8]) is set. */

/* Bit 13 - Source address filter fail */
#define ETH_RXDMA_SAF (1 << 13)
/* When set, this bit indicates that the SA field of frame failed the 
   SA filter in the MAC Core.
 */
/* Bit 12 - Length error */
#define ETH_RXDMA_LE (1 << 12)
/* When set, this bit indicates that the actual length of the received 
   frame does not match the value in the Length/ Type field. This bit 
   is valid only when the Frame type (RDES0[5]) bit is reset. */

/* Bit 11 - Overflow error */
#define ETH_RXDMA_OE (1 << 11)
/* When set, this bit indicates that the received frame was damaged due 
   to buffer overflow. */

/* Bit 10 - VLAN tag */
#define ETH_RXDMA_VLAN (1 << 10)
/* When set, this bit indicates that the frame pointed to by this 
   descriptor is a VLAN frame tagged by the MAC core. */

/* Bit 9 - First descriptor */
#define ETH_RXDMA_FS (1 << 9)
/* When set, this bit indicates that this descriptor contains the first 
   buffer of the frame. If the size of the first buffer is 0, the second 
   buffer contains the beginning of the frame. If the size of the second 
   buffer is also 0, the next descriptor contains the beginning 
   of the frame. */

