bobmittmann/thinkos/sdk/include/stm32f/stm32f-eth.h
/* Bit 8 - Last descriptor */
#define ETH_RXDMA_LS (1 << 8)
/* When set, this bit indicates that the buffers pointed to by this 
   descriptor are the last buffers of the frame.
   Bit 7 IPHCE/TSV: IPv header checksum error / time stamp valid
   If IPHCE is set, it indicates an error in the IPv4 or IPv6 header. This 
   error can be due to inconsistent Ethernet Type field and IP header 
   Version field values, a header checksum mismatch in IPv4, or an 
   Ethernet frame lacking the expected number of IP header bytes. This 
   bit can take on special meaning as specified in Table 145. If enhanced 
   descriptor format is enabled (EDFE=1, bit 7 of ETH_DMABMR), this bit 
   takes on the TSV function (otherwise it is IPHCE). When TSV is set, 
   it indicates that a snapshot of the timestamp is written in descriptor 
   words 6 (RDES6) and 7 (RDES7). TSV is valid only when the Last 
   descriptor bit (RDES0[8]) is set. */

/* Bit 6 - Late collision */
#define ETH_RXDMA_LCO (1 << 6)
/* When set, this bit indicates that a late collision has occurred while 
   receiving the frame in Half-duplex mode. */

/* Bit 5 - Frame type */
#define ETH_RXDMA_FT (1 << 5)
/* When set, this bit indicates that the Receive frame is an Ethernet-type 
   frame (the LT field is greater than or equal to 0x0600). When this bit 
   is reset, it indicates that the received frame is an IEEE802.3 frame. 
   This bit is not valid for Runt frames less than 14 bytes. When the 
   normal descriptor format is used (ETH_DMABMR EDFE=0), FT can take on 
   special meaning as specified in Table 145. */

/* Bit 4 - Receive watchdog timeout */
#define ETH_RXDMA_RWT (1 << 4)
/* When set, this bit indicates that the Receive watchdog timer has expired 
   while receiving the current frame and the current frame is truncated 
   after the watchdog timeout. */

/* Bit 3 - Receive error */
#define ETH_RXDMA_RE (1 << 3)
/* When set, this bit indicates that the RX_ERR signal is asserted 
   while RX_DV is asserted during frame reception. */

/* Bit 2 - Dribble bit error */
#define ETH_RXDMA_DE (1 << 2)
/* When set, this bit indicates that the received frame has a non-integer 
   multiple of bytes (odd nibbles). This bit is valid only in MII mode. */

/* Bit 1 - CRC error */
#define ETH_RXDMA_CE (1 << 1)
/* When set, this bit indicates that a cyclic redundancy check (CRC) 
   error occurred on the received frame. This field is valid only when the 
   last descriptor (RDES0[8]) is set.
   Bit 0 PCE/ESA: Payload checksum error / extended status available
   When set, it indicates that the TCP, UDP or ICMP checksum the core 
   calculated does not match the received encapsulated TCP, UDP or ICMP 
   segmentâ€™s Checksum field. This bit is also set when the received number 
   of payload bytes does not match the value indicated in the Length 
   field of the encapsulated IPv4 or IPv6 datagram in the received Ethernet 
   frame. This bit can take on special meaning as specified in Table 145.
	If the enhanced descriptor format is enabled (EDFE=1, bit 7 in 
	ETH_DMABMR), this bit takes on the ESA function (otherwise it is PCE).
	When ESA is set, it indicates that the extended status is available 
	in descriptor word 4 (RDES4). ESA is valid only when the last 
	descriptor bit (RDES0[8]) is set. */

#define ETH_IPPT_UNKOWN (0 << 0)
#define ETH_IPPT_UDP    (1 << 0)
#define ETH_IPPT_TCP    (2 << 0)
#define ETH_IPPT_ICMP   (3 << 0)


/* Bit 31 - Own bit */
#define ETH_TXDMA_OWN (1 << 31)
/* When set, this bit indicates that the descriptor is owned by the 
   DMA. When this bit is reset, it indicates that the descriptor is 
   owned by the CPU. The DMA clears this bit either when it completes 
   the frame transmission or when the buffers allocated in the 
   descriptor are read completely. The ownership bit of the frameâ€™s 
   first descriptor must be set after all subsequent descriptors belonging 
   to the same frame have been set. */

/* Bit 30 - Interrupt on completion */
#define ETH_TXDMA_IC (1 << 30)
/* When set, this bit sets the Transmit Interrupt (Register 5[0]) after 
   the present frame has been transmitted. */

/* Bit 29 - Last segment */
#define ETH_TXDMA_LS (1 << 29)
/* When set, this bit indicates that the buffer contains the last segment 
   of the frame. */

/* Bit 28 - First segment */
#define ETH_TXDMA_FS (1 << 28)
/* When set, this bit indicates that the buffer contains the first 
   segment of a frame. */

/* Bit 27 - Disable CRC */
#define ETH_TXDMA_DC (1 << 27)
/* When this bit is set, the MAC does not append a cyclic redundancy 
   check (CRC) to the end of the transmitted frame. This is valid only 
   when the first segment (TDES0[28]) is set. */

/* Bit 26 - Disable pad */
#define ETH_TXDMA_DP (1 << 26)
/* When set, the MAC does not automatically add padding to a frame 
   shorter than 64 bytes.
   When this bit is reset, the DMA automatically adds padding and CRC to 
   a frame shorter than 64 bytes, and the CRC field is added despite the 
   state of the DC (TDES0[27]) bit. This is valid only when the first 
   segment (TDES0[28]) is set. */

/* Bit 25 - Transmit time stamp enable */
#define ETH_TXDMA_TTSE (1 << 25)
/* When TTSE is set and when TSE is set (ETH_PTPTSCR bit 0), IEEE1588 
   hardware time stamping is activated for the transmit frame described by 
   the descriptor. This field is only valid when the First segment control 
   bit (TDES0[28]) is set. */

/* Bit 24 - Reserved, must be kept at reset value. */

/* Bits 23:22 - Checksum insertion control */
#define ETH_TXDMA_CIC (3 << 22)
/* These bits control the checksum calculation and insertion. Bit 
   encoding is as shown below:
   00: Checksum Insertion disabled
   01: Only IP header checksum calculation and insertion are enabled
   10: IP header checksum and payload checksum calculation and insertion 
   are enabled, but pseudo-header checksum is not calculated in hardware
   11: IP Header checksum and payload checksum calculation and insertion 
   are enabled, and pseudo-header checksum is calculated in hardware. */

/* Bit 21 - Transmit end of ring */
#define ETH_TXDMA_TER (1 << 21)
/* When set, this bit indicates that the descriptor list reached its 
   final descriptor. The DMA returns to the base address of the list, 
   creating a descriptor ring. */

