bobmittmann/thinkos/sdk/include/stm32f/stm32f-eth.h
/* Bit 20 - Second address chained */
#define ETH_TXDMA_TCH (1 << 20)
/* When set, this bit indicates that the second address in the 
   descriptor is the next descriptor address rather than the second buffer 
   address. When TDES0[20] is set, TBS2 (TDES1[28:16]) is a â€œdonâ€™t 
   careâ€� value. TDES0[21] takes precedence over TDES0[20]. */

/* Bits 19:18 Reserved, must be kept at reset value. */

/* Bit 17 - Transmit time stamp status */
#define ETH_TXDMA_TTSS (1 << 17)
/* This field is used as a status bit to indicate that a time stamp was 
   captured for the described transmit frame. When this bit is set, 
   TDES2 and TDES3 have a time stamp value captured for the transmit 
   frame. This field is only valid when the descriptorâ€™s Last segment 
   control bit (TDES0[29]) is set.
   Note that when enhanced descriptors are enabled (EDFE=1 in 
   ETH_DMABMR), TTSS=1 indicates that TDES6 and TDES7 have the 
   time stamp value. */

/* Bit 16 - IP header error */
#define ETH_TXDMA_IHE (1 << 16)
/* When set, this bit indicates that the MAC transmitter detected an 
   error in the IP datagram header. The transmitter checks the header 
   length in the IPv4 packet against the number of header bytes received 
   from the application and indicates an error status if there is a 
   mismatch. For IPv6 frames, a header error is reported if the main 
   header length is not 40 bytes. Furthermore, the Ethernet length/type 
   field value for an IPv4 or IPv6 frame must match the IP header version 
   received with the packet. For IPv4 frames, an error status is also 
   indicated if the Header Length field has a value less than 0x5. */

/* Bit 15 - Error summary */
#define ETH_TXDMA_ES (1 << 15)
/* Indicates the logical OR of the following bits:
   TDES0[14]: Jabber timeout
   TDES0[13]: Frame flush
   TDES0[11]: Loss of carrier
   TDES0[10]: No carrier
   TDES0[9]: Late collision
   TDES0[8]: Excessive collision
   TDES0[2]:Excessive deferral
   TDES0[1]: Underflow error
   TDES0[16]: IP header error
   TDES0[12]: IP payload error */

/* Bit 14 - Jabber timeout */
#define ETH_TXDMA_JT (1 << 14)
/* When set, this bit indicates the MAC transmitter has experienced a 
   jabber timeout. This bit is only set when the MAC configuration 
   registerâ€™s JD bit is not set. */

/* Bit 13 - Frame flushed */
#define ETH_TXDMA_FF (1 << 13)
/* When set, this bit indicates that the DMA/MTL flushed the frame due 
   to a software Flush command given by the CPU. */

/* Bit 12 - IP payload error */
#define ETH_TXDMA_IPE (1 << 12)
/* When set, this bit indicates that MAC transmitter detected an error 
   in the TCP, UDP, or ICMP IP datagram payload. The transmitter checks 
   the payload length received in the IPv4 or IPv6 header against the 
   actual number of TCP, UDP or ICMP packet bytes received from the
   application and issues an error status in case of a mismatch. */

/* Bit 11 - Loss of carrier */
#define ETH_TXDMA_LCA (1 << 11)
/* When set, this bit indicates that a loss of carrier occurred during 
   frame transmission (that is, the MII_CRS signal was inactive for one 
   or more transmit clock periods during frame transmission). This is 
   valid only for the frames transmitted without collision when the MAC
   operates in Half-duplex mode. */

/* Bit 10 - No carrier */
#define ETH_TXDMA_NC (1 << 10)
/* When set, this bit indicates that the Carrier Sense signal form the 
   PHY was not asserted during transmission. */

/* Bit 9 - Late collision */
#define ETH_TXDMA_LCO (1 << 9)
/* When set, this bit indicates that frame transmission was aborted due 
   to a collision occurring after the collision window (64 byte times, 
   including preamble, in MII mode). This bit is not valid if the 
   Underflow Error bit is set. */

/* Bit 8 - Excessive collision */
#define ETH_TXDMA_EC (1 << 8)
/* When set, this bit indicates that the transmission was aborted after 
   16 successive collisions while attempting to transmit the current 
   frame. If the RD (Disable retry) bit in the MAC Configuration register 
   is set, this bit is set after the first collision, and the transmission 
   of the frame is aborted. */

/* Bit 7 - VLAN frame */
#define ETH_TXDMA_VF (1 << 7)
/* When set, this bit indicates that the transmitted frame was a 
   VLAN-type frame. */

/* Bits 6:3 - Collision count */
#define ETH_TXDMA_CC (0xf << 3)
/*	This 4-bit counter value indicates the number of collisions 
	occurring before the frame was transmitted. The count is not 
	valid when the Excessive collisions bit (TDES0[8]) is set. */

/* Bit 2 - Excessive deferral */
#define ETH_TXDMA_ED (1 << 2)
/* When set, this bit indicates that the transmission has ended 
   because of excessive deferral of over 24 288 bit times if the 
   Deferral check (DC) bit in the MAC Control register is set high. */

/* Bit 1 - Underflow error */
#define ETH_TXDMA_UF (1 << 1)
/* When set, this bit indicates that the MAC aborted the frame because 
   data arrived late from the RAM memory. Underflow error indicates that 
   the DMA encountered an empty transmit buffer while transmitting the 
   frame. The transmission process enters the Suspended state and sets 
   both Transmit underflow (Register 5[5]) and Transmit interrupt 
   (Register 5[0]). */

/* Bit 0 - Deferred bit */
#define ETH_TXDMA_DB (1 << 0)
/* When set, this bit indicates that the MAC defers before transmission 
   because of the presence of the carrier. This bit is valid only 
   in Half-duplex mode. */

#ifndef __ASSEMBLER__

#include <stdint.h>

struct stm32f_eth {
	volatile uint32_t maccr;
	volatile uint32_t macffr;
	volatile uint32_t machthr;
	volatile uint32_t machtlr;
	volatile uint32_t macmiiar;
	volatile uint32_t macmiidr;
	volatile uint32_t macfcr;
	volatile uint32_t macvlantr; /* 8 */
	uint32_t reserved0[2];
	volatile uint32_t macrwuffr; /* 11 */
	volatile uint32_t macpmtcsr;
	uint32_t reserved1[2];
	volatile uint32_t macsr; /* 15 */
	volatile uint32_t macimr;
	struct {
		volatile uint32_t hr;
		volatile uint32_t lr;
	} maca[4]; /* 24 */
	uint32_t reserved2[40];
	volatile uint32_t mmccr; /* 65 */
	volatile uint32_t mmcrir;
	volatile uint32_t mmctir;
	volatile uint32_t mmcrimr;
	volatile uint32_t mmctimr; /* 69 */
	uint32_t reserved3[14];
	volatile uint32_t mmctgfsccr; /* 84 */
	volatile uint32_t mmctgfmsccr;
	uint32_t reserved4[5];
	volatile uint32_t mmctgfcr;
	uint32_t reserved5[10];
	volatile uint32_t mmcrfcecr;
	volatile uint32_t mmcrfaecr;
	uint32_t reserved6[10];
	volatile uint32_t mmcrgufcr;
	uint32_t reserved7[334];
	volatile uint32_t ptptscr;
	volatile uint32_t ptpssir;
	volatile uint32_t ptptshr;
	volatile uint32_t ptptslr;
	volatile uint32_t ptptshur;
	volatile uint32_t ptptslur;
	volatile uint32_t ptptsar;
	volatile uint32_t ptptthr;
	volatile uint32_t ptpttlr;
	volatile uint32_t reserved8;
	volatile uint32_t ptptssr;
	uint32_t reserved9[565];
	volatile uint32_t dmabmr;
	volatile uint32_t dmatpdr;
	volatile uint32_t dmarpdr;
	volatile uint32_t dmardlar;
	volatile uint32_t dmatdlar;
	volatile uint32_t dmasr;
	volatile uint32_t dmaomr;
	volatile uint32_t dmaier;
	volatile uint32_t dmamfbocr;
	volatile uint32_t dmarswtr;
	uint32_t reserved10[8];
	volatile uint32_t dmachtdr;
	volatile uint32_t dmachrdr;
	volatile uint32_t dmachtbar;
	volatile uint32_t dmachrbar;
};

