bobmittmann/thinkos/sdk/include/stm32f/stm32f-eth.h
struct rxdma_st {
	uint32_t pce: 1; /* Payload checksum error */
	uint32_t ce: 1; /* CRC error */
	uint32_t dbe: 1; /* Dribble bit error */
	uint32_t re: 1; /* Receive error */
	uint32_t rwt: 1; /* Receive watchdog timeout */
	uint32_t ft: 1; /* Frame type */
	uint32_t lco: 1; /* Late collision */
	uint32_t iphce_tsv: 1; /* IPv header checksum error / 
							  time stamp valid */
	uint32_t ls: 1; /* Last descriptor */
	uint32_t fs: 1; /* First descriptor */
	uint32_t vlan: 1; /* VLAN tag */
	uint32_t oe: 1; /* Overflow error */
	uint32_t le: 1; /* Lenght error */
	uint32_t saf: 1; /* Source address filter fail */
	uint32_t de: 1; /* Descriptor error*/
	uint32_t es: 1; /* Error summary */
	uint32_t fl: 14; /* Frame length */
	uint32_t afm: 1; /* Destination address filter fail */
	uint32_t own: 1; /* Own bit */
};

/* Normal receive descriptor */
struct rxdma_desc {
	volatile union {
		uint32_t rdes0;
		struct rxdma_st st;
	};
	union {
		uint32_t rdes1;
		struct {
			uint32_t rbs1: 13; /* Receive buffer 1 size */
			uint32_t res1: 1;
			uint32_t rch: 1; /* Second address chained */
			uint32_t rer: 1; /* Receive end of ring */
			uint32_t rbs2: 15; /* Receive buffer 2 size */
			uint32_t dic: 1; /* Disable interrupt on completion */
		};
	};
	union {
		uint32_t rdes2;
		uint32_t * rbap1; /* Receive buffer 1 address pointer */
		uint32_t rtsl; /* Receive frame time stamp low */
	};
	union {
		uint32_t rdes3;
		uint32_t * rbap2; /* Receive buffer 2 address pointer */
		uint32_t rtsh; /* Receive frame time stamp high */
	};
};

struct rxdma_ext_st {
	uint32_t ippt: 3; /* IP payload type */
	uint32_t iphe: 1; /* IP header error */
	uint32_t ippe: 1; /* IP payload error */
	uint32_t ipcb: 1; /* IP checksum bypass */
	uint32_t ipv4pr: 1; /* IPv4 packet received */
	uint32_t ipv6pr: 1; /* IPv6 packet received */
	uint32_t pmt: 4; /* PTP message type */
	uint32_t pft: 1; /* PTP frame type */
	uint32_t pv: 1; /* PTP version */
	uint32_t res: 18;
};

/* Enhanced receive descriptor */
struct rxdma_enh_desc {
	volatile union {
		uint32_t rdes0;
		struct rxdma_st st;
	};
	union {
		uint32_t rdes1;
		struct {
			uint32_t rbs1: 13; /* Receive buffer 1 size */
			uint32_t res1: 1;
			uint32_t rch: 1; /* Second address chained */
			uint32_t rer: 1; /* Receive end of ring */
			uint32_t rbs2: 15; /* Receive buffer 2 size */
			uint32_t dic: 1; /* Disable interrupt on completion */
		};
	};
	union {
		uint32_t rdes2;
		uint32_t * rbap1; /* Receive buffer 1 address pointer */
	};
	union {
		uint32_t rdes3;
		uint32_t * rbap2; /* Receive buffer 2 address pointer */
	};
	union {
		uint32_t rdes4;
		struct rxdma_ext_st ext_st; /* Extended status */
	};
	union {
		uint32_t rdes5;
		uint32_t rtsl; /* Receive frame time stamp low */
	};
	union {
		uint32_t rdes6;
		uint32_t rtsh; /* Receive frame time stamp high */
	};
};

struct txdma_st {
	uint32_t db: 1; /* Deferred bit */
	uint32_t uf: 1; /* Underflow error */
	uint32_t ed: 1; /* Excessive deferral */
	uint32_t cc: 4; /* Collision count */
	uint32_t vf: 1; /* VLAN frame */

	uint32_t ec: 1; /* Excessive collision */
	uint32_t lco: 1; /* Late collision */
	uint32_t nc: 1; /* No carrier */
	uint32_t lca: 1; /* Loss of carrier */
	uint32_t ipe: 1; /* IP payload error */
	uint32_t ff: 1; /* Frame flushed */
	uint32_t jt: 1; /* Jabber timeout */
	uint32_t es: 1; /* Error summary */

	uint32_t ihe: 1; /* IP header error */
	uint32_t ttss: 1; /* Transmit time stamp status */
	uint32_t res1: 2; 
	uint32_t tch: 1; /* Second address chained */
	uint32_t ter: 1; /* Transmit end of ring */
	uint32_t cic: 2; /* Checksum insertion control */

	uint32_t res2: 1;
	uint32_t ttse: 1; /* Transmit time stamp enable */
	uint32_t dp: 1; /* Disable pad */
	uint32_t dc: 1; /* Disable CRC */
	uint32_t fs: 1; /* First segment */
	uint32_t ls: 1; /* Last segment */
	uint32_t ic: 1; /* Interrupt on completion */
	uint32_t own: 1; /* Own bit */
};

/* Normal transmit descriptor */
struct txdma_desc {
	volatile union {
		uint32_t tdes0;
		struct txdma_st st;
	};
	union {
		uint32_t tdes1;
		struct {
			uint32_t tbs1: 13; /* Buffer 1 byte count */
			uint32_t res1: 3;
			uint32_t tbs2: 13; /* Buffer 2 byte count */
			uint32_t res2: 3;
		};
	};
	union {
		uint32_t tdes2;
		uint32_t * tbap1; /* Transmit buffer 1 address pointer */
		uint32_t ttsl; /* Transmit frame time stamp low */
	};
	union {
		uint32_t tdes3;
		uint32_t * tbap2; /* Transmit buffer 2 address pointer */
		uint32_t ttsh; /* Transmit frame time stamp high */
	};
};

/* Enhanced transmit descriptor */
struct txdma_enh_desc {
	volatile union {
		uint32_t tdes0;
		volatile struct txdma_st st;
		struct {
			uint32_t db: 1; /* Deferred bit */
			uint32_t uf: 1; /* Underflow error */
			uint32_t ed: 1; /* Excessive deferral */
			uint32_t cc: 4; /* Collision count */
			uint32_t vf: 1; /* VLAN frame */

			uint32_t ec: 1; /* Excessive collision */
			uint32_t lco: 1; /* Late collision */
			uint32_t nc: 1; /* No carrier */
			uint32_t lca: 1; /* Loss of carrier */
			uint32_t ipe: 1; /* IP payload error */
			uint32_t ff: 1; /* Frame flushed */
			uint32_t jt: 1; /* Jabber timeout */
			uint32_t es: 1; /* Error summary */

			uint32_t ihe: 1; /* IP header error */
			uint32_t ttss: 1; /* Transmit time stamp status */
			uint32_t res1: 2; 
			uint32_t tch: 1; /* Second address chained */
			uint32_t ter: 1; /* Transmit end of ring */
			uint32_t cic: 2; /* Checksum insertion control */

			uint32_t res2: 1;
			uint32_t ttse: 1; /* Transmit time stamp enable */
			uint32_t dp: 1; /* Disable pad */
			uint32_t dc: 1; /* Disable CRC */
			uint32_t fs: 1; /* First segment */
			uint32_t ls: 1; /* Last segment */
			uint32_t ic: 1; /* Interrupt on completion */
			volatile uint32_t own: 1; /* Own bit */
		};
	};
	union {
		uint32_t tdes1;
		struct {
			uint32_t tbs1: 13; /* Buffer 1 byte count */
			uint32_t res3: 3;
			uint32_t tbs2: 13; /* Buffer 2 byte count */
			uint32_t res4: 3;
		};
	};
	union {
		uint32_t tdes2;
		uint32_t * volatile tbap1; /* Transmit buffer 1 address pointer */
	};
	union {
		uint32_t tdes3;
		uint32_t * volatile tbap2; /* Transmit buffer 2 address pointer */
	};
	union {
		uint32_t tdes4;
		uint32_t res5;
	};
	union {
		uint32_t tdes5;
		uint32_t res6;
	};
	union {
		uint32_t tdes6;
		uint32_t ttsl; /* Transmit frame time stamp low */
	};
	union {
		uint32_t tdes7;
		uint32_t ttsh; /* Transmit frame time stamp high */
	};
};

#endif /* __ASSEMBLER__ */

#endif /* __STM32F_ETH_H__ */

